g91/esp32-p4-Domo-cpu-emulator/main/hello_world_main.c
/*
 * Motorola 68000 Emulator Application
 * ESP32-P4 with 16MB RAM @ 60MHz simulation
 * With LCD Console and PS/2 Keyboard support
 * With i8086 PC Emulator support
 */

#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <stdarg.h>
#include <sys/stat.h>
#include <dirent.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_system.h"
#include "esp_log.h"
#include "esp_console.h"
#include "esp_vfs_dev.h"
#include "esp_vfs_fat.h"
#include "driver/uart.h"
#include "driver/uart_vfs.h"
#include "driver/sdmmc_host.h"
#include "sdmmc_cmd.h"
#if SOC_SDMMC_IO_POWER_EXTERNAL
#include "sd_pwr_ctrl_by_on_chip_ldo.h"
#endif
#include "linenoise/linenoise.h"
#include "argtable3/argtable3.h"
#include "nvs_flash.h"
#include "m68k_emulator.h"
#include "i8086_emulator.h"
#include "mos6502_emulator.h"
#include "apple2e_emulator.h"
#include "z80_emulator.h"
#include "video_card.h"
#include "disk_image.h"
#include "lcd_console.h"
#include "ps2_keyboard.h"
#include "usb_keyboard.h"
// Bluetooth support via ESP32-C6 SDIO using NimBLE + ESP-Hosted
#include "host/ble_hs.h"
#include "host/ble_gap.h"
#include "nimble/nimble_port.h"
#include "nimble/nimble_port_freertos.h"
// WiFi support via ESP32-C6 SDIO
#include "esp_wifi.h"
#include "esp_event.h" 
#include "esp_netif.h"
#include "lwip/err.h"
#include "lwip/sys.h"
#include "driver/usb_serial_jtag.h"
#include "bus_controller.h"
#include "atari_st.h"
#include "amiga.h"
#include "wifi_ftp_server.h"
#include "ssh_debug_server.h"
#include "ethernet_init.h"
#include "esp_eth.h"
#include <ctype.h>
#include "esp32_os.h"

static const char* TAG = "m68k_app";

// WiFi state for ESP32-C6 SDIO communication
static bool wifi_initialized = false;
static bool wifi_connected = false;
static char connected_ssid[32] = {0};
static esp_netif_ip_info_t ip_info = {0};
static int s_wifi_retry_num = 0;
#define WIFI_MAX_RETRY 10

// Ethernet state
static bool ethernet_initialized = false;

// Bluetooth state for ESP32-C6 SDIO communication
static bool bt_initialized = false;
static bool bt_scanning = false;

// ESP32 Native OS (Windows 3.1-style desktop)
static TaskHandle_t s_esp32os_task_handle = NULL;
static void esp32os_run_task(void *arg);

// i386 PC emulator (uses tiny386 engine via pc_emulator module)
static TaskHandle_t s_i86_task_handle = NULL;
static void i86_run_task(void *arg);

// Atari ST emulator (uses M68K core + Atari ST hardware)
static TaskHandle_t s_atari_task_handle = NULL;
static void atari_st_run_task(void *arg);

// Amiga emulator (uses M68K core + Amiga custom chips)
static TaskHandle_t s_amiga_task_handle = NULL;
static void amiga_run_task(void *arg);

#define MAX_BLE_DEVICES 20
typedef struct {
    uint8_t address[6];
    char name[64];
    int8_t rssi;
    bool valid;
} ble_device_t;
static ble_device_t ble_devices[MAX_BLE_DEVICES];
static int ble_device_count = 0;

// WiFi event handler
static void wifi_event_handler(void* arg, esp_event_base_t event_base,
                               int32_t event_id, void* event_data) {
    if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_START) {
        ESP_LOGI(TAG, "WiFi station started");
    } else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_DISCONNECTED) {
        wifi_connected = false;
        memset(connected_ssid, 0, sizeof(connected_ssid));
        // Auto-reconnect with retry limit
        if (s_wifi_retry_num < WIFI_MAX_RETRY) {
            s_wifi_retry_num++;
            ESP_LOGI(TAG, "WiFi disconnected, retrying (%d/%d)...", s_wifi_retry_num, WIFI_MAX_RETRY);
            vTaskDelay(pdMS_TO_TICKS(1000 * s_wifi_retry_num));  // Exponential backoff
            esp_wifi_connect();
        } else {
            ftp_server_stop();
            ESP_LOGW(TAG, "WiFi disconnected after %d retries - use 'connect' to retry", WIFI_MAX_RETRY);
            s_wifi_retry_num = 0;  // Reset for manual retry
        }
    } else if (event_base == IP_EVENT && event_id == IP_EVENT_STA_GOT_IP) {
        ip_event_got_ip_t* event = (ip_event_got_ip_t*) event_data;
        ip_info = event->ip_info;
        wifi_connected = true;
        s_wifi_retry_num = 0;  // Reset retry counter on successful connection
        
        // Save connected SSID
        wifi_ap_record_t ap;
        if (esp_wifi_sta_get_ap_info(&ap) == ESP_OK) {
            strlcpy(connected_ssid, (char*)ap.ssid, sizeof(connected_ssid));
        }
        
        ESP_LOGI(TAG, "WiFi connected, IP: " IPSTR, IP2STR(&event->ip_info.ip));
        
        // Start FTP server automatically when WiFi connects
        esp_err_t ret = ftp_server_init();
        if (ret == ESP_OK) {
            ESP_LOGI(TAG, "FTP server started at ftp://" IPSTR ":21 (root: /sdcard)", IP2STR(&event->ip_info.ip));
        } else {
            ESP_LOGE(TAG, "Failed to start FTP server: %s", esp_err_to_name(ret));
        }
        
        // Start SSH/Telnet debug server
        ret = ssh_debug_server_init();
        if (ret == ESP_OK) {
            ESP_LOGI(TAG, "Telnet debug console started at: telnet " IPSTR " 23", IP2STR(&event->ip_info.ip));
            ESP_LOGI(TAG, "Use 'crash' and 'dump' commands for M68K debugging");
        } else {
            ESP_LOGE(TAG, "Failed to start telnet server: %s", esp_err_to_name(ret));
        }
    }
}

// Ethernet event handler - auto-start services when Ethernet gets IP
static void eth_event_handler_main(void* arg, esp_event_base_t event_base,
                                   int32_t event_id, void* event_data) {
    if (event_base == ETH_EVENT) {
        if (event_id == ETHERNET_EVENT_CONNECTED) {
            ESP_LOGI(TAG, "Ethernet cable connected");
        } else if (event_id == ETHERNET_EVENT_DISCONNECTED) {
            ESP_LOGW(TAG, "Ethernet cable disconnected");
        }
    } else if (event_base == IP_EVENT && event_id == IP_EVENT_ETH_GOT_IP) {
        ip_event_got_ip_t* event = (ip_event_got_ip_t*) event_data;
        ESP_LOGI(TAG, "Ethernet got IP: " IPSTR, IP2STR(&event->ip_info.ip));
        
