g91/esp32-p4-Domo-cpu-emulator/main/hello_world_main.c
        // Auto-start FTP server if not already running
        if (!ftp_server_is_running()) {
            esp_err_t ret = ftp_server_init();
            if (ret == ESP_OK) {
                ESP_LOGI(TAG, "FTP server started via Ethernet at ftp://" IPSTR ":21", 
                         IP2STR(&event->ip_info.ip));
            }
        }
        
        // Auto-start telnet server
        esp_err_t ret = ssh_debug_server_init();
        if (ret == ESP_OK) {
            ESP_LOGI(TAG, "Telnet debug console via Ethernet: telnet " IPSTR " 23", 
                     IP2STR(&event->ip_info.ip));
        }
    }
}

// NimBLE GAP event handler for device discovery
static int gap_event_handler(struct ble_gap_event *event, void *arg) {
    switch (event->type) {
        case BLE_GAP_EVENT_DISC:
            // Device discovered during scan
            if (ble_device_count < MAX_BLE_DEVICES) {
                bool already_found = false;
                for (int i = 0; i < ble_device_count; i++) {
                    if (memcmp(ble_devices[i].address, event->disc.addr.val, 6) == 0) {
                        already_found = true;
                        ble_devices[i].rssi = event->disc.rssi;  // Update RSSI
                        break;
                    }
                }
                
                if (!already_found) {
                    memcpy(ble_devices[ble_device_count].address, event->disc.addr.val, 6);
                    ble_devices[ble_device_count].rssi = event->disc.rssi;
                    
                    // Extract device name from advertising data
                    struct ble_hs_adv_fields fields;
                    bool name_found = false;
                    
                    if (event->disc.length_data > 0) {
                        int rc = ble_hs_adv_parse_fields(&fields, event->disc.data, event->disc.length_data);
                        if (rc == 0) {
                            // Try complete local name first
                            if (fields.name != NULL && fields.name_len > 0 && fields.name_len < 64) {
                                memcpy(ble_devices[ble_device_count].name, fields.name, fields.name_len);
                                ble_devices[ble_device_count].name[fields.name_len] = '\0';
                                name_found = true;
                            }
                        }
                    }
                    
                    if (!name_found) {
                        snprintf(ble_devices[ble_device_count].name, sizeof(ble_devices[0].name), "Unknown");
                    }
                    
                    ble_devices[ble_device_count].valid = true;
                    ble_device_count++;
                }
            }
            return 0;
            
        case BLE_GAP_EVENT_DISC_COMPLETE:
            ESP_LOGI(TAG, "BLE scan complete");
            bt_scanning = false;
            return 0;
            
        default:
            return 0;
    }
}

// NimBLE host task
static void nimble_host_task(void *param) {
    nimble_port_run();
    nimble_port_freertos_deinit();
}

// Flag to track if LCD console is active
static bool lcd_console_active = false;

// Active CPU selection
typedef enum {
    ACTIVE_CPU_M68K,
    ACTIVE_CPU_I8086,
    ACTIVE_CPU_6502,
    ACTIVE_CPU_APPLE2E,
    ACTIVE_CPU_C128,
    ACTIVE_CPU_Z80      /* Z80 CP/M 2.2 */
} active_cpu_t;

static active_cpu_t active_cpu = ACTIVE_CPU_M68K;

// Command history file
#define HISTORY_FILE "/sdcard/.bash_history"
#define MAX_HISTORY_LINES 500

// Local command history for arrow key navigation
static char *cmd_history[MAX_HISTORY_LINES];
static int cmd_history_count = 0;

// Current working directory (for ls, cd, etc.)
static char current_working_dir[256] = "/sdcard";

/*
 * Resolve a path relative to the current working directory
 * Returns a malloc'd string that must be freed by the caller
 */
static char* resolve_path(const char *path) {
    char *result = malloc(512);
    if (!result) return NULL;
    
    if (path == NULL || strlen(path) == 0 || strcmp(path, ".") == 0) {
        // Current directory
        strcpy(result, current_working_dir);
    } else if (path[0] == '/') {
        // Absolute path
        strcpy(result, path);
    } else if (strcmp(path, "..") == 0) {
        // Parent directory
        strcpy(result, current_working_dir);
        char *last_slash = strrchr(result, '/');
        if (last_slash && last_slash != result) {
            *last_slash = '\0';
        } else {
            strcpy(result, "/sdcard");
        }
    } else if (strncmp(path, "../", 3) == 0) {
        // Parent + more path
        strcpy(result, current_working_dir);
        char *last_slash = strrchr(result, '/');
        if (last_slash && last_slash != result) {
            *last_slash = '\0';
        }
        strcat(result, "/");
        strcat(result, path + 3);
    } else {
        // Relative path
        snprintf(result, 512, "%s/%s", current_working_dir, path);
    }
    
    // Ensure we don't go above /sdcard
    if (strncmp(result, "/sdcard", 7) != 0) {
        strcpy(result, "/sdcard");
    }
    
    return result;
}

/*
 * Dual-output printf - sends to both UART and LCD console
 * Non-static: also used by i8086_emulator.c via console_printf()
 */
void dual_printf(const char *format, ...) {
    char buffer[512];
    va_list args;
    va_start(args, format);
    vsnprintf(buffer, sizeof(buffer), format, args);
    va_end(args);
    
    // Always print to UART
    printf("%s", buffer);
    
    // Route to video card framebuffer if active (avoids LCD conflict)
    if (video_card_is_initialized()) {
        video_card_print(buffer);
    } else if (lcd_console_active && lcd_console_is_initialized()) {
        lcd_console_print(buffer);
    }
}

// Real exported function for other modules (i8086_emulator.c, etc.)
int console_printf(const char *fmt, ...) {
    char buffer[512];
    va_list args;
    va_start(args, fmt);
    int len = vsnprintf(buffer, sizeof(buffer), fmt, args);
    va_end(args);
    printf("%s", buffer);
    if (video_card_is_initialized()) {
        video_card_print(buffer);
    } else if (lcd_console_active && lcd_console_is_initialized()) {
        lcd_console_print(buffer);
    }
    return len;
}

// Boot splash screen with animation
static void show_boot_splash(void) {
    if (!lcd_console_is_initialized()) return;
    
    // Single clear and draw - no flash effects to avoid SPI queue overflow
    lcd_console_clear();
    vTaskDelay(pdMS_TO_TICKS(50));  // Let SPI queue drain
    
    // Draw simple ASCII boot logo (avoid Unicode issues)
    const char *logo[] = {
        "================================",
        "   M68K FIRMWARE BIOS v1.0",
        "      ESP32-P4 @ 400MHz",
        "================================",
        "",
        "  Motorola 68000 @ 60MHz",
        "  Memory: 16MB PSRAM",
        "  Bus Controller: Active",
        "",
        "  System Ready",
    };
    
