g91/esp32-p4-Domo-cpu-emulator/main/hello_world_main.c
    for (int i = 0; i < sizeof(logo)/sizeof(logo[0]); i++) {
        lcd_console_print(logo[i]);
        lcd_console_print("\n");
    }
    
    vTaskDelay(pdMS_TO_TICKS(1000));
}

// SD Card variables
static sdmmc_card_t *sd_card = NULL;
static bool sd_mounted = false;

// Load command history from SD card
static void load_history(void) {
    if (!sd_mounted) return;
    
    FILE *f = fopen(HISTORY_FILE, "r");
    if (f == NULL) {
        ESP_LOGI(TAG, "No history file found");
        return;
    }
    
    char line[256];
    int count = 0;
    while (fgets(line, sizeof(line), f) != NULL && count < MAX_HISTORY_LINES) {
        // Remove newline
        line[strcspn(line, "\r\n")] = 0;
        if (strlen(line) > 0) {
            linenoiseHistoryAdd(line);
            // Also add to our local history
            cmd_history[cmd_history_count] = strdup(line);
            if (cmd_history[cmd_history_count]) {
                cmd_history_count++;
            }
            count++;
        }
    }
    fclose(f);
    ESP_LOGI(TAG, "Loaded %d history entries", count);
}

// Save command history to SD card
__attribute__((unused)) static void save_history(void) {
    if (!sd_mounted) return;
    
    FILE *f = fopen(HISTORY_FILE, "w");
    if (f == NULL) {
        ESP_LOGW(TAG, "Failed to save history");
        return;
    }
    
    // Get history from linenoise and save to file
    // Note: linenoise doesn't expose history directly, so we'll save on each add
    fclose(f);
}

// Append command to history file
static void append_to_history_file(const char *line) {
    if (!sd_mounted || line == NULL || strlen(line) == 0) return;
    
    FILE *f = fopen(HISTORY_FILE, "a");
    if (f != NULL) {
        fprintf(f, "%s\n", line);
        fclose(f);
    }
}

// SD Card pin definitions (SDMMC Slot 0 - ESP32-P4-NANO)
// Note: NANO doesn't have WiFi companion chip, so all SDMMC pins available
// Using default ESP32-P4 SDMMC pins
#define SD_CLK_PIN  43  // GPIO43 (SDMMC CLK)
#define SD_CMD_PIN  44  // GPIO44 (SDMMC CMD)
#define SD_D0_PIN   39  // GPIO39 (SDMMC D0)
#define SD_D1_PIN   40  // GPIO40 (SDMMC D1)
#define SD_D2_PIN   41  // GPIO41 (SDMMC D2)
#define SD_D3_PIN   42  // GPIO42 (SDMMC D3)

// I2S Audio pins (if ES8311 Codec available on NANO)
// NANO may not have audio codec - these are placeholder pins
#define I2S_MCLK_PIN    33  // GPIO33
#define I2S_SCLK_PIN    32  // GPIO32
#define I2S_DOUT_PIN    25  // GPIO25 (USBIP1_P0)
#define I2S_LRCK_PIN    26  // GPIO26 (USBIP1_N1)
#define I2S_DIN_PIN     36  // GPIO36
#define PA_CTRL_PIN     53  // GPIO53 (ADC2_CHANNEL6)

// I2C pins (shared bus for peripherals)
#define I2C_SCL_PIN     8   // GPIO8 (TOUCH_CHANNEL6) - SCL on pinout
#define I2C_SDA_PIN     7   // GPIO7 (TOUCH_CHANNEL5) - SDA on pinout
#define ES8311_I2C_ADDR 0x18

// Example 68000 program: Simple loop that increments D0
static const uint8_t example_program[] = {
    // Reset vectors at 0x00000000
    0x00, 0x00, 0xFF, 0xFC,  // Initial SSP = 0x00FFFFFC (top of RAM)
    0x00, 0x00, 0x00, 0x10,  // Initial PC = 0x00000010 (start of program)
    
    0x00, 0x00, 0x00, 0x00,  // Padding
    0x00, 0x00, 0x00, 0x00,
    
    // Program starts at 0x00000010
    0x70, 0x00,              // MOVEQ #0, D0          ; D0 = 0
    0x52, 0x40,              // ADDQ.W #1, D0         ; D0++
    0x0C, 0x40, 0x00, 0x0A,  // CMPI.W #10, D0        ; Compare D0 with 10
    0x6F, 0xF8,              // BLE -8                ; Branch if <= (loop)
    0x4E, 0x71,              // NOP                   ; No operation
    0x60, 0xFE,              // BRA -2                ; Loop forever
};

/* ====== SD Card Functions ====== */

static esp_err_t mount_sd_card(void) {
    if (sd_mounted) {
        ESP_LOGW(TAG, "SD card already mounted");
        return ESP_OK;
    }

    esp_err_t ret;

    // Note: ESP32-P4-NANO uses SDMMC Slot 0 for SD card (4-bit mode)
    // Unlike the WIFI6 board, NANO doesn't have WiFi companion chip on SDIO
    // So SDMMC Slot 0 is the only slot, used for SD card
    
    esp_vfs_fat_sdmmc_mount_config_t mount_config = {
        .format_if_mount_failed = false,
        .max_files = 20,  // Increased for FTP file operations
        .allocation_unit_size = 16 * 1024
    };

    // Use SDMMC Slot 0 (4-wire mode)
    sdmmc_host_t host = SDMMC_HOST_DEFAULT();
    host.slot = SDMMC_HOST_SLOT_0;  // NANO only has Slot 0 (no WiFi chip)
    // Note: max_freq_khz defaults to SDMMC_FREQ_DEFAULT (20MHz) which is safer for init

    // ESP32-P4 requires LDO power control for SD card pins
#if SOC_SDMMC_IO_POWER_EXTERNAL
    sd_pwr_ctrl_ldo_config_t ldo_config = {
        .ldo_chan_id = 4,  // LDO channel 4 for ESP32-P4
    };
    sd_pwr_ctrl_handle_t pwr_ctrl_handle = NULL;

    ret = sd_pwr_ctrl_new_on_chip_ldo(&ldo_config, &pwr_ctrl_handle);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to create LDO power control: %s", esp_err_to_name(ret));
        return ret;
    }
    host.pwr_ctrl_handle = pwr_ctrl_handle;
    ESP_LOGI(TAG, "LDO power control initialized (channel 4)");
#endif

    // SDMMC Slot 0 configuration (4-bit mode)
    sdmmc_slot_config_t slot_config = SDMMC_SLOT_CONFIG_DEFAULT();
    slot_config.width = 4;  // 4-bit mode
    slot_config.clk = SD_CLK_PIN;
    slot_config.cmd = SD_CMD_PIN;
    slot_config.d0 = SD_D0_PIN;
    slot_config.d1 = SD_D1_PIN;
    slot_config.d2 = SD_D2_PIN;
    slot_config.d3 = SD_D3_PIN;
    slot_config.flags |= SDMMC_SLOT_FLAG_INTERNAL_PULLUP;

    ESP_LOGI(TAG, "Mounting SD card via SDMMC Slot 0 (4-bit, CLK=%d, CMD=%d, D0=%d, D1=%d, D2=%d, D3=%d)...",
             SD_CLK_PIN, SD_CMD_PIN, SD_D0_PIN, SD_D1_PIN, SD_D2_PIN, SD_D3_PIN);
    ret = esp_vfs_fat_sdmmc_mount("/sdcard", &host, &slot_config, &mount_config, &sd_card);

    if (ret != ESP_OK) {
        if (ret == ESP_FAIL) {
            ESP_LOGE(TAG, "Failed to mount filesystem. Format card as FAT32.");
        } else {
            ESP_LOGE(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        }
        return ret;
    }

    sd_mounted = true;
    ESP_LOGI(TAG, "SD card mounted successfully via SDMMC Slot 0");

    // Print card info
    sdmmc_card_print_info(stdout, sd_card);
    printf("SD Card: %.2f GB\n", ((uint64_t)sd_card->csd.capacity) * sd_card->csd.sector_size / (1024.0 * 1024.0 * 1024.0));

    return ESP_OK;
}

static void unmount_sd_card(void) {
    if (!sd_mounted) {
        return;
    }

    esp_vfs_fat_sdcard_unmount("/sdcard", sd_card);
    sd_mounted = false;
    
    // Note: LDO power control handle cleanup would go here if we stored it
    // For now, it's local to mount_sd_card() so no cleanup needed
    
    sd_card = NULL;
    ESP_LOGI(TAG, "SD card unmounted");
}

/* ====== Auto-Boot Feature ====== */

// M68K OS execution task
static void m68k_os_task(void *arg) {
    printf("M68K-OS task started\n");
    
    // Video card is already initialized and showing welcome text.
    // Do NOT call lcd_console_clear() - that fights with the video card refresh task.
    // If we need a clean screen, use the video card's text clear instead.
    if (video_card_is_initialized()) {
        video_card_text_clear();
        video_card_print("M68K-OS Booting...\n\n");
    }
    
    // Run M68K continuously - it will handle console I/O through bus controller
    while (true) {
        // Execute instructions in batches
        m68k_run(1000);
        
