g91/esp32-p4-Domo-cpu-emulator/main/hello_world_main.c
        // Check if halted
        if (m68k_is_halted()) {
            printf("M68K-OS halted\n");
            break;
        }
        
        // Small yield to allow other tasks
        vTaskDelay(pdMS_TO_TICKS(1));
    }
    
    printf("M68K-OS task ended\n");
    vTaskDelete(NULL);
}

// Forward declarations for boot menu
static TaskHandle_t s_6502_task_handle = NULL;
static void mos6502_run_task(void *arg);

static TaskHandle_t s_apple2e_task_handle = NULL;
static void apple2e_run_task(void *arg);

// Try to auto-boot OS.bin from SD card root
// Returns true if OS was loaded and started, false otherwise
static bool try_autoboot(void) {
    if (!sd_mounted) {
        return false;
    }
    
    const char *os_path = "/sdcard/OS.bin";
    
    // Check if OS.bin exists
    struct stat st;
    bool os_exists = (stat(os_path, &st) == 0);
    
    // Check if any i8086 boot disk exists
    bool i86_disk_found = false;
    const char *i86_disk_paths[] = {
        "/sdcard/freedos.img",
        "/sdcard/boot.img",
        "/sdcard/dos.img",
        "/sdcard/floppy.img",
        "/sdcard/hdd.img",
        NULL
    };
    const char *i86_boot_disk = NULL;
    for (int i = 0; i86_disk_paths[i] != NULL; i++) {
        struct stat st2;
        if (stat(i86_disk_paths[i], &st2) == 0) {
            i86_disk_found = true;
            i86_boot_disk = i86_disk_paths[i];
            break;
        }
    }
    
    // Check for 6502 program
    bool mos6502_prog_found = false;
    struct stat st6502;
    if (stat("/sdcard/6502.bin", &st6502) == 0) {
        mos6502_prog_found = true;
    }

    // Check for C64 ROMs (need at least kernal.rom)
    bool c64_roms_found = false;
    struct stat st_c64;
    if (stat("/sdcard/c64/kernal.rom", &st_c64) == 0) {
        c64_roms_found = true;
    }

    // Check for VIC-20 ROMs (need at least kernal.rom)
    bool vic20_roms_found = false;
    struct stat st_vic20;
    if (stat("/sdcard/vic20/kernal.rom", &st_vic20) == 0) {
        vic20_roms_found = true;
    }

    // Check for C128 ROMs (need at least kernal.rom)
    bool c128_roms_found = false;
    struct stat st_c128;
    if (stat("/sdcard/c128/kernal.rom", &st_c128) == 0) {
        c128_roms_found = true;
    }

    // Check for Apple IIe ROMs
    bool apple2e_roms_found = false;
    const char *apple2e_rom_paths[] = {
        "/sdcard/apple2e/apple2e_enhanced.rom",
        "/sdcard/apple2e/apple2e.rom",
        "/sdcard/apple2e/APPLE2E.ROM",
        NULL
    };
    for (int i = 0; apple2e_rom_paths[i] != NULL; i++) {
        struct stat st_a2;
        if (stat(apple2e_rom_paths[i], &st_a2) == 0) {
            apple2e_roms_found = true;
            break;
        }
    }

    // Check for Atari ST TOS ROM
    bool atari_tos_found = false;
    const char *atari_tos_path = NULL;
    const char *atari_tos_paths[] = {
        "/sdcard/atarist/tos.img",
        "/sdcard/atarist/tos.rom",
        "/sdcard/atarist/tos104.img",
        "/sdcard/tos.img",
        "/sdcard/tos.rom",
        NULL
    };
    for (int i = 0; atari_tos_paths[i] != NULL; i++) {
        struct stat st_tos;
        if (stat(atari_tos_paths[i], &st_tos) == 0) {
            atari_tos_found = true;
            atari_tos_path = atari_tos_paths[i];
            break;
        }
    }
    // Check for Atari ST floppy disk
    const char *atari_floppy_path = NULL;
    const char *atari_floppy_paths[] = {
        "/sdcard/atarist/disk.st",
        "/sdcard/atarist/floppy.st",
        "/sdcard/disk.st",
        NULL
    };
    for (int i = 0; atari_floppy_paths[i] != NULL; i++) {
        struct stat st_fl;
        if (stat(atari_floppy_paths[i], &st_fl) == 0) {
            atari_floppy_path = atari_floppy_paths[i];
            break;
        }
    }

    // Check for Amiga Kickstart ROM
    bool amiga_kick_found = false;
    const char *amiga_kick_path = NULL;
    const char *amiga_kick_paths[] = {
        "/sdcard/amiga/kick.rom",
        "/sdcard/amiga/kick13.rom",
        "/sdcard/amiga/kick20.rom",
        "/sdcard/amiga/kick31.rom",
        "/sdcard/kick.rom",
        NULL
    };
    for (int i = 0; amiga_kick_paths[i] != NULL; i++) {
        struct stat st_ak;
        if (stat(amiga_kick_paths[i], &st_ak) == 0) {
            amiga_kick_found = true;
            amiga_kick_path = amiga_kick_paths[i];
            break;
        }
    }
    // Check for Amiga floppy disk (ADF)
    const char *amiga_floppy_path = NULL;
    const char *amiga_floppy_paths[] = {
        "/sdcard/amiga/df0.adf",
        "/sdcard/amiga/workbench.adf",
        "/sdcard/amiga/boot.adf",
        NULL
    };
    for (int i = 0; amiga_floppy_paths[i] != NULL; i++) {
        struct stat st_af;
        if (stat(amiga_floppy_paths[i], &st_af) == 0) {
            amiga_floppy_path = amiga_floppy_paths[i];
            break;
        }
    }
    // Check for Amiga hard disk (HDF)
    const char *amiga_hdf_path = NULL;
    const char *amiga_hdf_paths[] = {
        "/sdcard/amiga/hd0.hdf",
        "/sdcard/amiga/hardfile.hdf",
        NULL
    };
    for (int i = 0; amiga_hdf_paths[i] != NULL; i++) {
        struct stat st_ah;
        if (stat(amiga_hdf_paths[i], &st_ah) == 0) {
            amiga_hdf_path = amiga_hdf_paths[i];
            break;
        }
    }

    // If nothing bootable exists, skip boot menu
    if (!os_exists && !i86_disk_found && !mos6502_prog_found && !c64_roms_found && !vic20_roms_found && !atari_tos_found && !amiga_kick_found && !c128_roms_found && !apple2e_roms_found) {
        return false;
    }
    
    // Show boot menu
    printf("\n");
    printf("╔══════════════════════════════════════════════════╗\n");
    printf("║              SYSTEM BOOT MENU                    ║\n");
    printf("╚══════════════════════════════════════════════════╝\n");
    printf("\n");
    if (os_exists) {
        printf("  [1] Boot M68K-OS (Motorola 68000, from OS.bin)\n");
    } else {
        printf("  [1] (M68K-OS not found)\n");
    }
    printf("  [2] Enter BIOS Shell\n");
    if (i86_disk_found) {
        printf("  [3] Boot IBM PC (Intel 8086, from %s)\n", i86_boot_disk);
    } else {
        printf("  [3] Boot IBM PC (mount disk first)\n");
    }
    if (mos6502_prog_found) {
        printf("  [4] Boot MOS 6502 (from 6502.bin)\n");
    } else {
        printf("  [4] Boot MOS 6502 (bare, no program)\n");
    }
    if (c64_roms_found) {
        printf("  [5] Boot Commodore 64 (C64 emulation)\n");
    } else {
        printf("  [5] Boot C64 (ROMs needed in /sdcard/c64/)\n");
    }
    if (vic20_roms_found) {
        printf("  [6] Boot VIC-20 (VIC-20 emulation)\n");
    } else {
        printf("  [6] Boot VIC-20 (ROMs needed in /sdcard/vic20/)\n");
    }
    if (atari_tos_found) {
        printf("  [7] Boot Atari ST (TOS from %s)\n", atari_tos_path);
    } else {
        printf("  [7] Boot Atari ST (TOS needed in /sdcard/atarist/)\n");
    }
    if (amiga_kick_found) {
        printf("  [8] Boot Amiga (Kickstart from %s)\n", amiga_kick_path);
    } else {
        printf("  [8] Boot Amiga (ROM needed in /sdcard/amiga/)\n");
    }
    if (c128_roms_found) {
        printf("  [9] Boot Commodore 128 (C128 emulation)\n");
    } else {
        printf("  [9] Boot C128 (ROMs needed in /sdcard/c128/)\n");
    }
    if (apple2e_roms_found) {
        printf("  [0] Boot Apple IIe (Apple II emulation)\n");
    } else {
        printf("  [0] Boot Apple IIe (ROM needed in /sdcard/apple2e/)\n");
    }
    printf("  [Z] Boot CP/M 2.2 (Z80 emulator, disks in /sdcard/cpm/)\n");
    printf("  [W] Boot ESP32 Native OS (Windows 3.1 desktop, mouse+keyboard)\n");
    printf("\n");
    printf("Select option (0-9, Z, W): ");
    
    // Show boot menu on display - use video card if active, otherwise lcd_console
    if (video_card_is_initialized()) {
        video_card_text_clear();
        video_card_print("SYSTEM BOOT MENU\n");
        video_card_print("================\n\n");
        if (os_exists) video_card_print("[1] Boot M68K-OS\n");
        video_card_print("[2] Enter BIOS\n");
        if (i86_disk_found) video_card_print("[3] Boot IBM PC\n");
        video_card_print("[4] MOS 6502\n");
        if (c64_roms_found) video_card_print("[5] Commodore 64\n");
        if (vic20_roms_found) video_card_print("[6] VIC-20\n");
        if (atari_tos_found) video_card_print("[7] Atari ST\n");
        if (amiga_kick_found) video_card_print("[8] Amiga\n");
        if (c128_roms_found) video_card_print("[9] C128\n");
        if (apple2e_roms_found) video_card_print("[0] Apple IIe\n");
        video_card_print("[Z] CP/M 2.2\n");
        video_card_print("[W] ESP32 Native OS\n");
        video_card_print("\nSelect 0-9, Z, W...\n");
    } else if (lcd_console_is_initialized()) {
        lcd_console_clear();
        lcd_console_print("SYSTEM BOOT MENU\n");
        lcd_console_print("================\n\n");
        if (os_exists) {
            lcd_console_print("[1] Boot M68K-OS\n");
        }
        lcd_console_print("[2] Enter BIOS\n");
        if (i86_disk_found) {
            lcd_console_print("[3] Boot IBM PC\n");
        }
        lcd_console_print("[4] MOS 6502\n");
        if (c64_roms_found) {
            lcd_console_print("[5] Commodore 64\n");
        }
        if (vic20_roms_found) {
            lcd_console_print("[6] VIC-20\n");
        }
        if (atari_tos_found) {
            lcd_console_print("[7] Atari ST\n");
        }
        if (amiga_kick_found) {
            lcd_console_print("[8] Amiga\n");
        }
        if (c128_roms_found) {
            lcd_console_print("[9] C128\n");
        }
        if (apple2e_roms_found) {
            lcd_console_print("[0] Apple IIe\n");
        }
        lcd_console_print("[Z] CP/M 2.2\n");
        lcd_console_print("[W] ESP32 Native OS\n");
        lcd_console_print("\nSelect 0-9, Z, W...\n");
    }
    
