g91/esp32-p4-Domo-cpu-emulator/main/hello_world_main.c
    // Wait for user selection with 5-second timeout (default to BIOS if no input)
    int selection = 0;
    int timeout_count = 0;
    while (selection == 0) {
        // Check PS/2 keyboard input first (if initialized)
        if (ps2_keyboard_is_initialized()) {
            if (ps2_keyboard_available()) {
                uint8_t key = ps2_keyboard_read();
                if (key == '1' && os_exists) {
                    selection = 1;
                    printf("1\n");
                } else if (key == '2') {
                    selection = 2;
                    printf("2\n");
                } else if (key == '3') {
                    selection = 3;
                    printf("3\n");
                } else if (key == '4') {
                    selection = 4;
                    printf("4\n");
                } else if (key == '5') {
                    selection = 5;
                    printf("5\n");
                } else if (key == '6') {
                    selection = 6;
                    printf("6\n");
                } else if (key == '7') {
                    selection = 7;
                    printf("7\n");
                } else if (key == '8') {
                    selection = 8;
                    printf("8\n");
                } else if (key == '9') {
                    selection = 9;
                    printf("9\n");
                } else if (key == '0') {
                    selection = 10;
                    printf("0\n");
                } else if (key == 'z' || key == 'Z') {
                    selection = 11;
                    printf("Z\n");
                } else if (key == 'w' || key == 'W') {
                    selection = 12;
                    printf("W\n");
                }
            }
        }

        // Check USB keyboard input (if initialized)
        if (selection == 0 && usb_keyboard_is_initialized() && usb_keyboard_available()) {
            uint8_t key = usb_keyboard_read();
            if (key == '1' && os_exists) { selection = 1; printf("1\n"); }
            else if (key == '2') { selection = 2; printf("2\n"); }
            else if (key == '3') { selection = 3; printf("3\n"); }
            else if (key == '4') { selection = 4; printf("4\n"); }
            else if (key == '5') { selection = 5; printf("5\n"); }
            else if (key == '6') { selection = 6; printf("6\n"); }
            else if (key == '7') { selection = 7; printf("7\n"); }
            else if (key == '8') { selection = 8; printf("8\n"); }
            else if (key == '9') { selection = 9; printf("9\n"); }
            else if (key == '0') { selection = 10; printf("0\n"); }
            else if (key == 'z' || key == 'Z') { selection = 11; printf("Z\n"); }
            else if (key == 'w' || key == 'W') { selection = 12; printf("W\n"); }
        }

        // Check UART/USB Serial input (non-blocking)
        uint8_t uart_data;
        int len = uart_read_bytes(UART_NUM_0, &uart_data, 1, pdMS_TO_TICKS(10));
        if (len > 0) {
            if (uart_data == '1' && os_exists) {
                selection = 1;
                printf("1\n");
            } else if (uart_data == '2') {
                selection = 2;
                printf("2\n");
            } else if (uart_data == '3') {
                selection = 3;
                printf("3\n");
            } else if (uart_data == '4') {
                selection = 4;
                printf("4\n");
            } else if (uart_data == '5') {
                selection = 5;
                printf("5\n");
            } else if (uart_data == '6') {
                selection = 6;
                printf("6\n");
            } else if (uart_data == '7') {
                selection = 7;
                printf("7\n");
            } else if (uart_data == '8') {
                selection = 8;
                printf("8\n");
            } else if (uart_data == '9') {
                selection = 9;
                printf("9\n");
            } else if (uart_data == '0') {
                selection = 10;
                printf("0\n");
            } else if (uart_data == 'z' || uart_data == 'Z') {
                selection = 11;
                printf("Z\n");
            } else if (uart_data == 'w' || uart_data == 'W') {
                selection = 12;
                printf("W\n");
            }
        }

        vTaskDelay(pdMS_TO_TICKS(50));
        timeout_count++;
    }
    
    if (selection == 2) {
        // User chose BIOS
        printf("\nEntering BIOS...\n\n");
        if (video_card_is_initialized()) {
            video_card_text_clear();
            video_card_print("Entering BIOS...\n");
        } else if (lcd_console_is_initialized()) {
            lcd_console_clear();
            lcd_console_print("Entering BIOS...\n");
        }
        vTaskDelay(pdMS_TO_TICKS(1000));
        return false;
    }
    
    if (selection == 3) {
        // User chose i8086 PC mode
        printf("\nBooting IBM PC (i8086)...\n\n");
        if (video_card_is_initialized()) {
            video_card_text_clear();
            video_card_print("Booting IBM PC...\n\n");
        } else if (lcd_console_is_initialized()) {
            lcd_console_print("Booting IBM PC...\n\n");
        }

        // Initialize video card GPU for display output
        if (!video_card_is_initialized()) {
            video_card_init();
        }

        // Initialize i8086 emulator
        i86_config_t i86_config = {
            .ram_size = I86_RAM_SIZE,
            .cpu_freq_mhz = 8,
            .enable_fpu = false,
            .enable_sound = false,
            .boot_disk = i86_boot_disk,
        };
        esp_err_t i86_ret = i86_init(&i86_config);
        if (i86_ret != ESP_OK) {
            printf("Failed to init i8086: %s\n", esp_err_to_name(i86_ret));
            return false;
        }
        
        // If a boot disk was found, mount it
        if (i86_boot_disk) {
            disk_type_t type = disk_detect_type(i86_boot_disk);
            int drive = (type == DISK_TYPE_HARD_DISK) ? 2 : 0;
            i86_mount_disk(drive, i86_boot_disk);
            printf("Mounted %s as drive %c:\n", i86_boot_disk,
                   drive < 2 ? 'A' + drive : 'C' + (drive - 2));
        }
        
        // Boot in a FreeRTOS task
        BaseType_t task_ret = xTaskCreate(i86_run_task, "i8086_emu", 16384, NULL, 5, &s_i86_task_handle);
        if (task_ret == pdPASS) {
            printf("i8086 PC emulator running. UART available for monitoring.\n");
            printf("Use 'stop86' to halt, or reset device.\n\n");
            while (s_i86_task_handle != NULL) {
                vTaskDelay(pdMS_TO_TICKS(1000));
            }
            return false;  // Return to BIOS shell when emulator exits
        } else {
            printf("Failed to start i8086 task\n");
            return false;
        }
    }
    
