g91/esp32-p4-Domo-cpu-emulator/main/hello_world_main.c
    // ---- MOS 6502 / C64 / VIC-20 boot handlers ----
    if (selection >= 4 && selection <= 6) {
        mos6502_machine_mode_t mode;
        const char *mode_name;

        switch (selection) {
        case 4:
            mode = MOS6502_MODE_BARE;
            mode_name = "MOS 6502 (bare)";
            break;
        case 5:
            mode = MOS6502_MODE_C64;
            mode_name = "Commodore 64";
            break;
        case 6:
        default:
            mode = MOS6502_MODE_VIC20;
            mode_name = "VIC-20";
            break;
        }

        printf("\nBooting %s...\n\n", mode_name);
        {
            char lcd_msg[64];
            snprintf(lcd_msg, sizeof(lcd_msg), "Booting %s...\n\n", mode_name);
            if (video_card_is_initialized()) {
                video_card_text_clear();
                video_card_print(lcd_msg);
            } else if (lcd_console_is_initialized()) {
                lcd_console_clear();
                lcd_console_print(lcd_msg);
            }
        }

        // Initialize video card GPU (handles all display output)
        if (!video_card_is_initialized()) {
            esp_err_t vid_ret = video_card_init();
            if (vid_ret != ESP_OK) {
                printf("Warning: Video card init failed: %s\n", esp_err_to_name(vid_ret));
            }
        }

        // Initialize emulator in the selected mode
        esp_err_t ret = mos6502_emu_init_mode(mode);
        if (ret != ESP_OK) {
            printf("Failed to init 6502: %s\n", esp_err_to_name(ret));
            return false;
        }

        // Load ROMs for C64/VIC-20 modes
        if (mode != MOS6502_MODE_BARE) {
            ret = mos6502_emu_load_roms();
            if (ret != ESP_OK) {
                printf("Warning: ROM loading had issues\n");
            }
        }

        // For bare mode, try to load 6502.bin
        if (mode == MOS6502_MODE_BARE && mos6502_prog_found) {
            FILE *f = fopen("/sdcard/6502.bin", "rb");
            if (f) {
                fseek(f, 0, SEEK_END);
                long fsize = ftell(f);
                fseek(f, 0, SEEK_SET);
                uint8_t *buf = malloc(fsize);
                if (buf) {
                    fread(buf, 1, fsize, f);
                    mos6502_emu_load_program(buf, fsize, 0xE000);
                    free(buf);
                    printf("Loaded 6502.bin (%ld bytes at $E000)\n", fsize);
                }
                fclose(f);
            }
        }

        // Reset CPU (reads vectors from $FFFC/$FFFD)
        mos6502_emu_reset();

        // Set active CPU
        active_cpu = ACTIVE_CPU_6502;

        // Start running in a FreeRTOS task
        if (s_6502_task_handle == NULL) {
            BaseType_t task_ret = xTaskCreate(mos6502_run_task, "6502_run", 8192, NULL, 5, &s_6502_task_handle);
            if (task_ret == pdPASS) {
                printf("%s running. Use 'stop6502' to halt.\n\n", mode_name);
                while (s_6502_task_handle != NULL) {
                    vTaskDelay(pdMS_TO_TICKS(1000));
                }
                return false;  // Return to BIOS shell
            } else {
                printf("Failed to start 6502 task\n");
            }
        }
        return false;
    }

    // ---- Atari ST boot handler ----
    if (selection == 7) {
        printf("\nBooting Atari ST...\n\n");
        if (video_card_is_initialized()) {
            video_card_text_clear();
            video_card_print("Booting Atari ST...\n\n");
        } else if (lcd_console_is_initialized()) {
            lcd_console_clear();
            lcd_console_print("Booting Atari ST...\n\n");
        }

        atari_st_config_t atari_config = {
            .ram_size = ATARI_RAM_SIZE,
            .tos_path = atari_tos_path,
            .floppy_a_path = atari_floppy_path,
            .floppy_b_path = NULL,
            .cart_path = NULL,
            .enable_lcd_output = true,
        };

        esp_err_t atari_ret = atari_st_init(&atari_config);
        if (atari_ret != ESP_OK) {
            printf("Failed to init Atari ST: %s\n", esp_err_to_name(atari_ret));
            return false;
        }

        // Run in a FreeRTOS task
        BaseType_t task_ret = xTaskCreate(atari_st_run_task, "atari_st", 16384, NULL, 5, &s_atari_task_handle);
        if (task_ret == pdPASS) {
            printf("Atari ST emulator running. Press Ctrl+C in UART to stop.\n");
            if (atari_floppy_path) {
                printf("Floppy A: %s\n", atari_floppy_path);
            }
            printf("\n");
            while (s_atari_task_handle != NULL) {
                vTaskDelay(pdMS_TO_TICKS(1000));
            }
            return false;  // Return to BIOS shell
        } else {
            printf("Failed to start Atari ST task\n");
            atari_st_destroy();
            return false;
        }
    }

    // ---- Amiga boot handler ----
    if (selection == 8) {
        if (!amiga_kick_found) {
            printf("\nNo Kickstart ROM found. Place kick.rom in /sdcard/amiga/\n");
            return false;
        }
        printf("\nBooting Amiga...\n\n");
        if (video_card_is_initialized()) {
            video_card_text_clear();
            video_card_print("Booting Amiga...\n\n");
        } else if (lcd_console_is_initialized()) {
            lcd_console_clear();
            lcd_console_print("Booting Amiga...\n\n");
        }

        // Initialize video card GPU for display output
        if (!video_card_is_initialized()) {
            esp_err_t vid_ret = video_card_init();
            if (vid_ret != ESP_OK) {
                printf("Warning: Video card init failed: %s\n", esp_err_to_name(vid_ret));
            }
        }

        amiga_config_t amiga_config = {
            .chip_ram_size = AMIGA_CHIP_RAM_DEFAULT,
            .slow_ram_enabled = false,
            .kick_path = amiga_kick_path,
            .floppy_path = {NULL, NULL, NULL, NULL},
            .hdf_path = {NULL, NULL},
            .pal_mode = true,
        };
        if (amiga_floppy_path) {
            amiga_config.floppy_path[0] = amiga_floppy_path;
        }
        if (amiga_hdf_path) {
            amiga_config.hdf_path[0] = amiga_hdf_path;
        }

        esp_err_t amiga_ret = amiga_init(&amiga_config);
        if (amiga_ret != ESP_OK) {
            printf("Failed to init Amiga: %s\n", esp_err_to_name(amiga_ret));
            return false;
        }

        // Run in a FreeRTOS task
        BaseType_t task_ret = xTaskCreate(amiga_run_task, "amiga", 16384, NULL, 5, &s_amiga_task_handle);
        if (task_ret == pdPASS) {
            printf("Amiga emulator running. Press Ctrl+C in UART to stop.\n");
            if (amiga_floppy_path) {
                printf("Floppy DF0: %s\n", amiga_floppy_path);
            }
            if (amiga_hdf_path) {
                printf("Hard disk: %s\n", amiga_hdf_path);
            }
            printf("\n");
            while (s_amiga_task_handle != NULL) {
                vTaskDelay(pdMS_TO_TICKS(1000));
            }
            return false;  // Return to BIOS shell
        } else {
            printf("Failed to start Amiga task\n");
            amiga_destroy();
            return false;
        }
    }

