g91/esp32-p4-Domo-cpu-emulator/main/hello_world_main.c
    // ---- C128 boot handler ----
    if (selection == 9) {
        printf("\nBooting Commodore 128...\n\n");
        if (video_card_is_initialized()) {
            video_card_text_clear();
            video_card_print("Booting C128...\n\n");
        } else if (lcd_console_is_initialized()) {
            lcd_console_clear();
            lcd_console_print("Booting C128...\n\n");
        }

        if (!video_card_is_initialized()) {
            esp_err_t vid_ret = video_card_init();
            if (vid_ret != ESP_OK) {
                printf("Warning: Video card init failed: %s\n", esp_err_to_name(vid_ret));
            }
        }

        esp_err_t ret = mos6502_emu_init_mode(MOS6502_MODE_C128);
        if (ret != ESP_OK) {
            printf("Failed to init C128: %s\n", esp_err_to_name(ret));
            return false;
        }

        ret = mos6502_emu_load_roms();
        if (ret != ESP_OK) {
            printf("Warning: C128 ROM loading had issues\n");
        }

        mos6502_emu_reset();
        active_cpu = ACTIVE_CPU_C128;

        if (s_6502_task_handle == NULL) {
            BaseType_t task_ret = xTaskCreate(mos6502_run_task, "c128_run", 8192, NULL, 5, &s_6502_task_handle);
            if (task_ret == pdPASS) {
                printf("Commodore 128 running. Use 'stop6502' to halt.\n\n");
                while (s_6502_task_handle != NULL) {
                    vTaskDelay(pdMS_TO_TICKS(1000));
                }
                return false;
            } else {
                printf("Failed to start C128 task\n");
            }
        }
        return false;
    }

    // ---- Apple IIe boot handler ----
    if (selection == 10) {
        printf("\nBooting Apple IIe...\n\n");
        if (video_card_is_initialized()) {
            video_card_text_clear();
            video_card_print("Booting Apple IIe...\n\n");
        } else if (lcd_console_is_initialized()) {
            lcd_console_clear();
            lcd_console_print("Booting Apple IIe...\n\n");
        }

        if (!video_card_is_initialized()) {
            esp_err_t vid_ret = video_card_init();
            if (vid_ret != ESP_OK) {
                printf("Warning: Video card init failed: %s\n", esp_err_to_name(vid_ret));
            }
        }

        esp_err_t ret = apple2e_init();
        if (ret != ESP_OK) {
            printf("Failed to init Apple IIe: %s\n", esp_err_to_name(ret));
            return false;
        }

        ret = apple2e_load_roms();
        if (ret != ESP_OK) {
            printf("Warning: Apple IIe ROM loading had issues\n");
        }

        apple2e_reset();
        active_cpu = ACTIVE_CPU_APPLE2E;

        if (s_apple2e_task_handle == NULL) {
            BaseType_t task_ret = xTaskCreate(apple2e_run_task, "apple2e", 8192, NULL, 5, &s_apple2e_task_handle);
            if (task_ret == pdPASS) {
                printf("Apple IIe running. Press Ctrl+C to exit.\n\n");
                while (s_apple2e_task_handle != NULL) {
                    vTaskDelay(pdMS_TO_TICKS(1000));
                }
                return false;
            } else {
                printf("Failed to start Apple IIe task\n");
            }
        }
        return false;
    }

    // ---- CP/M 2.2 / Z80 boot handler ----
    if (selection == 11) {
        printf("\nBooting CP/M 2.2 (Z80)...\n\n");
        if (video_card_is_initialized()) {
            video_card_text_clear();
            video_card_print("Booting CP/M 2.2...\n\n");
        } else if (lcd_console_is_initialized()) {
            lcd_console_clear();
            lcd_console_print("Booting CP/M 2.2\n");
            lcd_console_print("Z80 @ 4 MHz\n\n");
        }

        z80_emu_config_t cpm_config = {
            .disk_dir    = "/sdcard/cpm",
            .prog_path   = NULL,
            .enable_lcd  = true,
            .cpu_freq_hz = 4000000,
        };

        esp_err_t ret = z80_emu_init(&cpm_config);
        if (ret != ESP_OK) {
            printf("Failed to init CP/M: %s\n", esp_err_to_name(ret));
            return false;
        }

        /* Try to auto-load a .COM file if found in /sdcard/cpm/a/ */
        const char *autorun_path = "/sdcard/cpm/a/cpm22.com";
        struct stat autorun_st;
        if (stat(autorun_path, &autorun_st) == 0) {
            z80_emu_load_com(autorun_path);
        }

        active_cpu = ACTIVE_CPU_Z80;

        /* Run inline (blocks until CP/M exits or user presses Ctrl+C) */
        z80_emu_run();

        z80_emu_deinit();
        active_cpu = ACTIVE_CPU_M68K;
        return false;  /* Return to BIOS shell */
    }

    // ---- ESP32 Native OS (Windows 3.1-style desktop) ----
    if (selection == 12) {
        printf("\nBooting ESP32 Native OS...\n\n");
        if (video_card_is_initialized()) {
            video_card_text_clear();
            video_card_print("ESP32 Native OS\n");
            video_card_print("Windows 3.1 Desktop\n");
            video_card_print("Starting...\n");
        } else if (lcd_console_is_initialized()) {
            lcd_console_clear();
            lcd_console_print("ESP32 Native OS\n");
            lcd_console_print("Starting...\n");
        }

        // Ensure GPU video card is initialized
        if (!video_card_is_initialized()) {
            esp_err_t vid_ret = video_card_init();
            if (vid_ret != ESP_OK) {
                printf("Warning: Video card init failed: %s\n", esp_err_to_name(vid_ret));
            }
        }

        if (s_esp32os_task_handle == NULL) {
            BaseType_t task_ret = xTaskCreate(esp32os_run_task, "esp32os", 16384,
                                              NULL, 5, &s_esp32os_task_handle);
            if (task_ret == pdPASS) {
                printf("ESP32 Native OS running. Press ESC to exit.\n\n");
                while (s_esp32os_task_handle != NULL) {
                    vTaskDelay(pdMS_TO_TICKS(1000));
                }
                return false;
            } else {
                printf("Failed to start ESP32 OS task\n");
            }
        }
        return false;
    }

