g91/esp32-p4-Domo-cpu-emulator/main/hello_world_main.c
    if (selection != 1 || !os_exists) {
        return false;
    }

    // User chose to boot M68K OS (selection == 1)
    printf("\nBooting M68K-OS...\n\n");
    if (video_card_is_initialized()) {
        video_card_text_clear();
        video_card_print("Booting M68K-OS...\n\n");
    } else if (lcd_console_is_initialized()) {
        lcd_console_clear();
        lcd_console_print("Booting M68K-OS...\n\n");
    }

    // Initialize GPU video card for M68K-OS
    if (!video_card_is_initialized()) {
        esp_err_t vid_ret = video_card_init();
        if (vid_ret == ESP_OK) {
            printf("Video card GPU initialized for M68K-OS\n");
        } else {
            printf("Warning: Video card init failed: %s\n", esp_err_to_name(vid_ret));
        }
    }
    // Set emulator memory read callback so GPU can read vertex/index data from M68K RAM
    video_card_set_emu_read(m68k_read_memory_8);
    
    long file_size = st.st_size;
    if (file_size <= 0 || file_size > 16 * 1024 * 1024) {
        printf("Invalid OS.bin size: %ld bytes\n", file_size);
        return false;
    }
    
    FILE *file = fopen(os_path, "rb");
    if (file == NULL) {
        printf("Failed to open OS.bin\n");
        return false;
    }
    
    // Allocate buffer and read file
    uint8_t *buffer = heap_caps_malloc(file_size, MALLOC_CAP_SPIRAM);
    if (buffer == NULL) {
        printf("Failed to allocate %ld bytes for OS\n", file_size);
        fclose(file);
        return false;
    }
    
    size_t bytes_read = fread(buffer, 1, file_size, file);
    fclose(file);
    
    if (bytes_read != file_size) {
        printf("Failed to read OS.bin: got %d, expected %ld\n", (int)bytes_read, file_size);
        free(buffer);
        return false;
    }
    
    printf("Loading M68K-OS (%ld bytes)...\n", file_size);
    
    // Load at address 0x0000 (contains vectors + code)
    m68k_load_program(buffer, file_size, 0x0000);
    free(buffer);
    
    printf("OS loaded at 0x00000000\n");
    printf("Resetting CPU to start execution...\n");
    
    // Reset CPU (loads PC and SP from vectors)
    m68k_reset();
    
    printf("Starting M68K-OS in background task...\n");
    printf("OS has full control of LCD and keyboard\n");
    printf("(UART still available for debugging)\n");
    printf("\n");
    
    // Create M68K OS execution task
    BaseType_t ret = xTaskCreate(
        m68k_os_task,
        "m68k_os",
        8192,           // 8KB stack
        NULL,
        5,              // Normal priority
        NULL
    );
    
    if (ret != pdPASS) {
        printf("Failed to create M68K OS task\n");
        return false;
    }
    
    // OS is running in background, don't show BIOS prompt
    return true;
}

/* ====== Console Commands ====== */

static int cmd_m68k_init(int argc, char **argv) {
    esp_err_t ret = m68k_init();
    if (ret == ESP_OK) {
        printf("68000 CPU initialized successfully\n");
        printf("  CPU: Motorola 68000 @ 60 MHz\n");
        printf("  RAM: 16 MB\n");
    } else {
        printf("Failed to initialize CPU: %s\n", esp_err_to_name(ret));
    }
    return 0;
}

static int cmd_m68k_reset(int argc, char **argv) {
    m68k_reset();
    printf("CPU reset\n");
    return 0;
}

static int cmd_m68k_load_example(int argc, char **argv) {
    m68k_load_program(example_program, sizeof(example_program), 0x0000);
    printf("Loaded example program (%d bytes)\n", sizeof(example_program));
    printf("Program description:\n");
    printf("  - Initializes D0 to 0\n");
    printf("  - Increments D0 in a loop\n");
    printf("  - Stops when D0 reaches 10\n");
    printf("\nUse 'reset' to set PC and SP from vectors\n");
    printf("Use 'run <N>' to execute N instructions\n");
    return 0;
}

static int cmd_m68k_run(int argc, char **argv) {
    if (argc < 2) {
        printf("Usage: run <instructions>\n");
        return 1;
    }
    
    uint32_t count = atoi(argv[1]);
    if (count == 0) count = 1;
    
    printf("Running %lu instructions...\n", (unsigned long)count);
    m68k_run(count);
    printf("Done\n");
    
    return 0;
}

static int cmd_m68k_step(int argc, char **argv) {
    printf("Executing 1 instruction...\n");
    m68k_step();
    return 0;
}

static int cmd_m68k_state(int argc, char **argv) {
    char buffer[1024];
    m68k_get_state(buffer, sizeof(buffer));
    printf("%s\n", buffer);
    return 0;
}

static int cmd_m68k_dump(int argc, char **argv) {
    uint32_t addr = 0;
    uint32_t length = 256;  // Default 256 bytes
    
    if (argc >= 2) {
        addr = strtol(argv[1], NULL, 16);
    }
    if (argc >= 3) {
        length = strtol(argv[2], NULL, 0);  // Accepts both decimal and hex (0x prefix)
    }
    
    if (argc == 1) {
        console_printf("Usage: dump [address_hex] [length]\n");
        console_printf("  address_hex: Starting address in hex (default: 0)\n");
        console_printf("  length: Number of bytes to dump (default: 256)\n");
        console_printf("Examples:\n");
        console_printf("  dump              - Dump 256 bytes from 0x00000000\n");
        console_printf("  dump 1000         - Dump 256 bytes from 0x00001000\n");
        console_printf("  dump 1000 64      - Dump 64 bytes from 0x00001000\n");
        console_printf("  dump 00EFFE90 128 - Dump 128 bytes from stack pointer area\n");
        return 0;
    }
    
    m68k_dump_memory(addr, length);
    return 0;
}

static int cmd_m68k_crash(int argc, char **argv) {
    m68k_show_crash_context();
    return 0;
}

static int cmd_m68k_poke(int argc, char **argv) {
    if (argc < 3) {
        printf("Usage: poke <addr_hex> <value_hex>\n");
        printf("Example: poke 1000 AA\n");
        return 1;
    }
    
    // This would require exposing write functions from emulator
    printf("Poke not yet implemented\n");
    return 0;
}

static int cmd_sd_mount(int argc, char **argv) {
    esp_err_t ret = mount_sd_card();
    if (ret == ESP_OK) {
        printf("SD card mounted at /sdcard\n");
    } else {
        printf("Failed to mount SD card: %s\n", esp_err_to_name(ret));
    }
    return 0;
}

static int cmd_sd_unmount(int argc, char **argv) {
    unmount_sd_card();
    printf("SD card unmounted\n");
    return 0;
}

/* ====== Linux-style File System Commands ====== */

// ls - List directory contents
static int cmd_ls(int argc, char **argv) {
    if (!sd_mounted) {
        console_printf("SD card not mounted. Use 'sdmount' first.\n");
        return 1;
    }

    char *path = NULL;
    bool long_format = false;
    bool show_all = false;
    
    // Parse arguments
    for (int i = 1; i < argc; i++) {
        if (strcmp(argv[i], "-l") == 0) {
            long_format = true;
        } else if (strcmp(argv[i], "-a") == 0) {
            show_all = true;
        } else if (strcmp(argv[i], "-la") == 0 || strcmp(argv[i], "-al") == 0) {
            long_format = true;
            show_all = true;
        } else if (argv[i][0] != '-') {
            path = resolve_path(argv[i]);
        }
    }
    
