g91/esp32-p4-Domo-cpu-emulator/main/hello_world_main.c
    if (path == NULL) {
        path = resolve_path(NULL);  // Use current directory
    }

    DIR *dir = opendir(path);
    if (dir == NULL) {
        console_printf("ls: cannot access '%s': No such directory\n", path);
        free(path);
        return 1;
    }

    struct dirent *entry;
    struct stat st;
    char filepath[512];
    int count = 0;

    if (long_format) {
        console_printf("total in %s:\n", path);
    }

    while ((entry = readdir(dir)) != NULL) {
        // Skip hidden files unless -a specified
        if (!show_all && entry->d_name[0] == '.') {
            continue;
        }
        
        snprintf(filepath, sizeof(filepath), "%s/%s", path, entry->d_name);
        
        if (long_format) {
            if (stat(filepath, &st) == 0) {
                char type = S_ISDIR(st.st_mode) ? 'd' : '-';
                console_printf("%crw-r--r-- %8ld  %s\n", type, st.st_size, entry->d_name);
            } else {
                console_printf("?????????? %8s  %s\n", "?", entry->d_name);
            }
        } else {
            if (stat(filepath, &st) == 0 && S_ISDIR(st.st_mode)) {
                console_printf("%s/  ", entry->d_name);
            } else {
                console_printf("%s  ", entry->d_name);
            }
            count++;
            if (count % 4 == 0) console_printf("\n");
        }
    }
    
    if (!long_format && count % 4 != 0) {
        console_printf("\n");
    }

    closedir(dir);
    free(path);
    return 0;
}

// cd - Change directory
static int cmd_cd(int argc, char **argv) {
    if (!sd_mounted) {
        console_printf("SD card not mounted. Use 'sdmount' first.\n");
        return 1;
    }

    const char *target = (argc >= 2) ? argv[1] : "/sdcard";
    char *new_path = resolve_path(target);
    
    if (new_path == NULL) {
        console_printf("cd: memory allocation failed\n");
        return 1;
    }
    
    // Verify the directory exists
    struct stat st;
    if (stat(new_path, &st) != 0 || !S_ISDIR(st.st_mode)) {
        console_printf("cd: %s: No such directory\n", target);
        free(new_path);
        return 1;
    }
    
    // Update current working directory
    strncpy(current_working_dir, new_path, sizeof(current_working_dir) - 1);
    current_working_dir[sizeof(current_working_dir) - 1] = '\0';
    
    free(new_path);
    return 0;
}

// pwd - Print working directory
static int cmd_pwd(int argc, char **argv) {
    (void)argc; (void)argv;
    console_printf("%s\n", current_working_dir);
    return 0;
}

// cat - Display file contents
static int cmd_cat(int argc, char **argv) {
    if (!sd_mounted) {
        console_printf("SD card not mounted. Use 'sdmount' first.\n");
        return 1;
    }

    if (argc < 2) {
        console_printf("Usage: cat <filename>\n");
        return 1;
    }

    char *filepath = resolve_path(argv[1]);
    if (filepath == NULL) {
        console_printf("cat: memory allocation failed\n");
        return 1;
    }

    FILE *f = fopen(filepath, "r");
    if (f == NULL) {
        console_printf("cat: %s: No such file\n", argv[1]);
        free(filepath);
        return 1;
    }

    char line[256];
    while (fgets(line, sizeof(line), f) != NULL) {
        console_printf("%s", line);
    }

    fclose(f);
    free(filepath);
    return 0;
}

// mkdir - Create directory
static int cmd_mkdir(int argc, char **argv) {
    if (!sd_mounted) {
        console_printf("SD card not mounted. Use 'sdmount' first.\n");
        return 1;
    }

    if (argc < 2) {
        console_printf("Usage: mkdir <dirname>\n");
        return 1;
    }

    char *dirpath = resolve_path(argv[1]);
    if (dirpath == NULL) {
        console_printf("mkdir: memory allocation failed\n");
        return 1;
    }

    if (mkdir(dirpath, 0755) != 0) {
        console_printf("mkdir: cannot create directory '%s'\n", argv[1]);
        free(dirpath);
        return 1;
    }

    free(dirpath);
    return 0;
}

// rm - Remove file
static int cmd_rm(int argc, char **argv) {
    if (!sd_mounted) {
        console_printf("SD card not mounted. Use 'sdmount' first.\n");
        return 1;
    }

    if (argc < 2) {
        console_printf("Usage: rm <filename>\n");
        return 1;
    }

    char *filepath = resolve_path(argv[1]);
    if (filepath == NULL) {
        console_printf("rm: memory allocation failed\n");
        return 1;
    }

    if (unlink(filepath) != 0) {
        console_printf("rm: cannot remove '%s'\n", argv[1]);
        free(filepath);
        return 1;
    }

    free(filepath);
    return 0;
}

// rmdir - Remove directory
static int cmd_rmdir(int argc, char **argv) {
    if (!sd_mounted) {
        console_printf("SD card not mounted. Use 'sdmount' first.\n");
        return 1;
    }

    if (argc < 2) {
        console_printf("Usage: rmdir <dirname>\n");
        return 1;
    }

    char *dirpath = resolve_path(argv[1]);
    if (dirpath == NULL) {
        console_printf("rmdir: memory allocation failed\n");
        return 1;
    }

    if (rmdir(dirpath) != 0) {
        console_printf("rmdir: failed to remove '%s'\n", argv[1]);
        free(dirpath);
        return 1;
    }

    free(dirpath);
    return 0;
}

// cp - Copy file
static int cmd_cp(int argc, char **argv) {
    if (!sd_mounted) {
        console_printf("SD card not mounted. Use 'sdmount' first.\n");
        return 1;
    }

    if (argc < 3) {
        console_printf("Usage: cp <source> <dest>\n");
        return 1;
    }

    char *src = resolve_path(argv[1]);
    char *dst = resolve_path(argv[2]);
    
    if (src == NULL || dst == NULL) {
        console_printf("cp: memory allocation failed\n");
        free(src);
        free(dst);
        return 1;
    }

    FILE *fsrc = fopen(src, "rb");
    if (fsrc == NULL) {
        console_printf("cp: cannot open '%s'\n", argv[1]);
        free(src);
        free(dst);
        return 1;
    }

    FILE *fdst = fopen(dst, "wb");
    if (fdst == NULL) {
        console_printf("cp: cannot create '%s'\n", argv[2]);
        fclose(fsrc);
        free(src);
        free(dst);
        return 1;
    }

    char buffer[512];
    size_t bytes;
    while ((bytes = fread(buffer, 1, sizeof(buffer), fsrc)) > 0) {
        fwrite(buffer, 1, bytes, fdst);
    }

    fclose(fsrc);
    fclose(fdst);
    free(src);
    free(dst);
    
    console_printf("File copied.\n");
    return 0;
}

// mv - Move/rename file
static int cmd_mv(int argc, char **argv) {
    if (!sd_mounted) {
        console_printf("SD card not mounted. Use 'sdmount' first.\n");
        return 1;
    }

    if (argc < 3) {
        console_printf("Usage: mv <source> <dest>\n");
        return 1;
    }

    char *src = resolve_path(argv[1]);
    char *dst = resolve_path(argv[2]);
    
    if (src == NULL || dst == NULL) {
        console_printf("mv: memory allocation failed\n");
        free(src);
        free(dst);
        return 1;
    }

