g91/esp32-p4-Domo-cpu-emulator/main/hello_world_main.c
    if (rename(src, dst) != 0) {
        console_printf("mv: cannot move '%s' to '%s'\n", argv[1], argv[2]);
        free(src);
        free(dst);
        return 1;
    }

    free(src);
    free(dst);
    return 0;
}

// touch - Create empty file or update timestamp
static int cmd_touch(int argc, char **argv) {
    if (!sd_mounted) {
        console_printf("SD card not mounted. Use 'sdmount' first.\n");
        return 1;
    }

    if (argc < 2) {
        console_printf("Usage: touch <filename>\n");
        return 1;
    }

    char *filepath = resolve_path(argv[1]);
    if (filepath == NULL) {
        console_printf("touch: memory allocation failed\n");
        return 1;
    }

    FILE *f = fopen(filepath, "a");
    if (f == NULL) {
        console_printf("touch: cannot touch '%s'\n", argv[1]);
        free(filepath);
        return 1;
    }

    fclose(f);
    free(filepath);
    return 0;
}

// echo - Print text (with > redirect support)
static int cmd_echo(int argc, char **argv) {
    if (argc < 2) {
        console_printf("\n");
        return 0;
    }

    // Check for redirection
    int redirect_idx = -1;
    bool append = false;
    for (int i = 1; i < argc; i++) {
        if (strcmp(argv[i], ">") == 0) {
            redirect_idx = i;
            break;
        } else if (strcmp(argv[i], ">>") == 0) {
            redirect_idx = i;
            append = true;
            break;
        }
    }

    if (redirect_idx > 0 && redirect_idx < argc - 1) {
        // Redirect to file
        char *filepath = resolve_path(argv[redirect_idx + 1]);
        if (filepath == NULL) {
            console_printf("echo: memory allocation failed\n");
            return 1;
        }

        FILE *f = fopen(filepath, append ? "a" : "w");
        if (f == NULL) {
            console_printf("echo: cannot open '%s'\n", argv[redirect_idx + 1]);
            free(filepath);
            return 1;
        }

        for (int i = 1; i < redirect_idx; i++) {
            fprintf(f, "%s", argv[i]);
            if (i < redirect_idx - 1) fprintf(f, " ");
        }
        fprintf(f, "\n");
        fclose(f);
        free(filepath);
    } else {
        // Print to console
        for (int i = 1; i < argc; i++) {
            console_printf("%s", argv[i]);
            if (i < argc - 1) console_printf(" ");
        }
        console_printf("\n");
    }

    return 0;
}

// clear - Clear screen
static int cmd_clear(int argc, char **argv) {
    (void)argc; (void)argv;
    
    // Clear UART terminal (ANSI escape codes)
    printf("\033[2J\033[H");
    
    // Clear LCD if active
    if (lcd_console_active && lcd_console_is_initialized()) {
        lcd_console_clear();
    }
    
    return 0;
}

// history - Show command history
static int cmd_show_history(int argc, char **argv) {
    (void)argc; (void)argv;
    
    for (int i = 0; i < cmd_history_count; i++) {
        if (cmd_history[i]) {
            console_printf("%4d  %s\n", i + 1, cmd_history[i]);
        }
    }
    return 0;
}

// df - Show disk free space
static int cmd_df(int argc, char **argv) {
    (void)argc; (void)argv;
    
    if (!sd_mounted || !sd_card) {
        console_printf("SD card not mounted.\n");
        return 1;
    }
    
    uint64_t total = (uint64_t)sd_card->csd.capacity * sd_card->csd.sector_size;
    
    console_printf("Filesystem      Size      Used      Avail  Use%%  Mounted on\n");
    console_printf("/dev/mmcblk0    %4lluMB    ---       ---    ---   /sdcard\n", total / (1024*1024));
    
    return 0;
}

// head - Show first lines of a file
static int cmd_head(int argc, char **argv) {
    if (!sd_mounted) {
        console_printf("SD card not mounted.\n");
        return 1;
    }
    
    if (argc < 2) {
        console_printf("Usage: head [-n lines] <filename>\n");
        return 1;
    }
    
    int lines = 10;
    const char *filename = argv[1];
    
    if (argc >= 4 && strcmp(argv[1], "-n") == 0) {
        lines = atoi(argv[2]);
        filename = argv[3];
    }
    
    char *filepath = resolve_path(filename);
    if (filepath == NULL) return 1;
    
    FILE *f = fopen(filepath, "r");
    if (f == NULL) {
        console_printf("head: cannot open '%s'\n", filename);
        free(filepath);
        return 1;
    }
    
    char line[256];
    int count = 0;
    while (fgets(line, sizeof(line), f) != NULL && count < lines) {
        console_printf("%s", line);
        count++;
    }
    
    fclose(f);
    free(filepath);
    return 0;
}

// tail - Show last lines of a file
static int cmd_tail(int argc, char **argv) {
    if (!sd_mounted) {
        console_printf("SD card not mounted.\n");
        return 1;
    }
    
    if (argc < 2) {
        console_printf("Usage: tail [-n lines] <filename>\n");
        return 1;
    }
    
    int lines = 10;
    const char *filename = argv[1];
    
    if (argc >= 4 && strcmp(argv[1], "-n") == 0) {
        lines = atoi(argv[2]);
        filename = argv[3];
    }
    
    char *filepath = resolve_path(filename);
    if (filepath == NULL) return 1;
    
    // Read all lines into circular buffer
    FILE *f = fopen(filepath, "r");
    if (f == NULL) {
        console_printf("tail: cannot open '%s'\n", filename);
        free(filepath);
        return 1;
    }
    
    char **line_buf = malloc(lines * sizeof(char*));
    if (line_buf == NULL) {
        fclose(f);
        free(filepath);
        return 1;
    }
    
    for (int i = 0; i < lines; i++) line_buf[i] = NULL;
    
    char line[256];
    int idx = 0;
    int total = 0;
    while (fgets(line, sizeof(line), f) != NULL) {
        free(line_buf[idx]);
        line_buf[idx] = strdup(line);
        idx = (idx + 1) % lines;
        total++;
    }
    fclose(f);
    
    // Print last N lines
    int start = (total < lines) ? 0 : idx;
    int count = (total < lines) ? total : lines;
    for (int i = 0; i < count; i++) {
        int j = (start + i) % lines;
        if (line_buf[j]) {
            console_printf("%s", line_buf[j]);
            free(line_buf[j]);
        }
    }
    
    free(line_buf);
    free(filepath);
    return 0;
}

static int cmd_help(int argc, char **argv) {
    console_printf("\n=== ESP32-P4 Dual CPU Emulator - Available Commands ===\n\n");
    
