g91/esp32-p4-Domo-cpu-emulator/main/hello_world_main.c
    console_printf("📁 File System Commands:\n");
    console_printf("  ls [dir]           - List directory contents\n");
    console_printf("  cd <dir>           - Change directory\n"); 
    console_printf("  pwd                - Show current directory\n");
    console_printf("  cat <file>         - Display file contents\n");
    console_printf("  mkdir <dir>        - Create directory\n");
    console_printf("  rm <file>          - Remove file\n");
    console_printf("  rmdir <dir>        - Remove directory\n");
    console_printf("  cp <src> <dst>     - Copy file\n");
    console_printf("  mv <src> <dst>     - Move/rename file\n");
    console_printf("  touch <file>       - Create empty file\n");
    console_printf("  echo <text>        - Print text\n");
    console_printf("  head [-n N] <file> - Show first N lines\n");
    console_printf("  tail [-n N] <file> - Show last N lines\n");
    console_printf("  df                 - Show disk space\n\n");
    
    console_printf("💾 Storage Commands:\n");
    console_printf("  sdmount            - Mount SD card\n");
    console_printf("  sdunmount          - Unmount SD card\n");
    console_printf("  loadsd <file>      - Load binary from SD card\n\n");
    
    console_printf("🖥️  M68K Emulator Commands:\n");
    console_printf("  init               - Initialize M68K CPU\n");
    console_printf("  reset / resetm68k  - Reset M68K CPU\n");
    console_printf("  load <file>        - Load M68K binary\n");
    console_printf("  run [cycles]       - Run M68K emulation\n");
    console_printf("  runm68k [cycles]   - Run M68K emulation\n");
    console_printf("  step / stepm68k    - Single step M68K\n");
    console_printf("  state / statem68k  - Show M68K CPU state\n");
    console_printf("  dump <addr> <len>  - Dump M68K memory\n");
    console_printf("  switch m68k        - Set M68K as active CPU\n\n");
    
    console_printf("🖥️  i8086 Emulator Commands:\n");
    console_printf("  init86             - Initialize i8086 CPU\n");
    console_printf("  reset86            - Reset i8086 CPU\n");
    console_printf("  run86 [cycles]     - Run i8086 emulation\n");
    console_printf("  step86             - Single step i8086\n");
    console_printf("  state86            - Show i8086 CPU state\n");
    console_printf("  switch 86          - Set i8086 as active CPU\n\n");
    
    console_printf("💽 Disk Image Commands (i8086):\n");
    console_printf("  mkdisk <file> <size> - Create disk image\n");
    console_printf("  mount <drive> <file> - Mount disk to drive (A:, B:, C:, D:)\n");
    console_printf("  unmount <drive>    - Unmount drive\n");
    console_printf("  disks              - Show mounted disks\n\n");
    
    console_printf("📺 Display Commands:\n");
    console_printf("  lcd_init           - Initialize LCD display\n");
    console_printf("  lcd_test           - Test LCD display\n");
    console_printf("  lcdpins            - Show LCD GPIO pin configuration\n");
    console_printf("  clear              - Clear screen\n\n");
    
    console_printf("⌨️  Input Device Commands:\n");
    console_printf("  ps2test            - Test PS/2 keyboard (30 seconds)\n\n");
    
    console_printf("🔵 Bluetooth Commands:\n");
    console_printf("  btinit             - Initialize Bluetooth controller\n");
    console_printf("  btscan [sec]       - Scan for Bluetooth devices\n");
    console_printf("  btconnect <MAC>    - Connect to Bluetooth device\n");
    console_printf("  btdisconnect <MAC> - Disconnect Bluetooth device\n");
    console_printf("  btlist             - List Bluetooth devices\n\n");
    
    console_printf("📶 WiFi Commands:\n");
    console_printf("  scan               - Scan for WiFi networks\n");
    console_printf("  connect <ssid> <pw> - Connect to WiFi network\n");
    console_printf("  status             - Show WiFi status\n");
    console_printf("  disconnect         - Disconnect from WiFi\n\n");
    
    console_printf("🔧 System Commands:\n");
    console_printf("  history            - Show command history\n");
    console_printf("  appinfo            - Show application info\n");
    console_printf("  appstop            - Stop current application\n");
    console_printf("  help               - Show this help message\n\n");
    
    console_printf("💡 Quick Start:\n");
    console_printf("1. Mount SD card: sdmount\n");
    console_printf("2. Initialize display: lcd_init\n");
    console_printf("3. For M68K: init → loadsd program.bin → run\n");
    console_printf("4. For i8086: init86 → mkdisk boot.img 1.44M → mount A boot.img → run86\n");
    console_printf("5. For Bluetooth: btinit → btscan → btconnect <MAC>\n");
    console_printf("6. For WiFi: scan → connect <ssid> <password> → status\n\n");
    
    console_printf("📖 For detailed guides, see:\n");
    console_printf("   QUICK_START.md, I8086_QUICK_START.md, BLUETOOTH_HID_GUIDE.md\n\n");
    
    return 0;
}

// Register all Linux-style filesystem commands
static void register_linux_commands(void) {
    const esp_console_cmd_t ls_cmd = {
        .command = "ls",
        .help = "List directory contents",
        .hint = "[-l] [-a] [path]",
        .func = &cmd_ls,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&ls_cmd));
    
    const esp_console_cmd_t cd_cmd = {
        .command = "cd",
        .help = "Change directory",
        .hint = "[path]",
        .func = &cmd_cd,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&cd_cmd));
    
    const esp_console_cmd_t pwd_cmd = {
        .command = "pwd",
        .help = "Print working directory",
        .hint = NULL,
        .func = &cmd_pwd,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&pwd_cmd));
    
    const esp_console_cmd_t cat_cmd = {
        .command = "cat",
        .help = "Display file contents",
        .hint = "<filename>",
        .func = &cmd_cat,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&cat_cmd));
    
    const esp_console_cmd_t mkdir_cmd = {
        .command = "mkdir",
        .help = "Create directory",
        .hint = "<dirname>",
        .func = &cmd_mkdir,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&mkdir_cmd));
    
    const esp_console_cmd_t rm_cmd = {
        .command = "rm",
        .help = "Remove file",
        .hint = "<filename>",
        .func = &cmd_rm,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&rm_cmd));
    
    const esp_console_cmd_t rmdir_cmd = {
        .command = "rmdir",
        .help = "Remove directory",
        .hint = "<dirname>",
        .func = &cmd_rmdir,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&rmdir_cmd));
    
    const esp_console_cmd_t cp_cmd = {
        .command = "cp",
        .help = "Copy file",
        .hint = "<source> <dest>",
        .func = &cmd_cp,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&cp_cmd));
    
