g91/esp32-p4-Domo-cpu-emulator/main/hello_world_main.c
    const esp_console_cmd_t mv_cmd = {
        .command = "mv",
        .help = "Move/rename file",
        .hint = "<source> <dest>",
        .func = &cmd_mv,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&mv_cmd));
    
    const esp_console_cmd_t touch_cmd = {
        .command = "touch",
        .help = "Create empty file",
        .hint = "<filename>",
        .func = &cmd_touch,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&touch_cmd));
    
    const esp_console_cmd_t echo_cmd = {
        .command = "echo",
        .help = "Print text or write to file",
        .hint = "<text> [> file]",
        .func = &cmd_echo,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&echo_cmd));
    
    const esp_console_cmd_t clear_cmd = {
        .command = "clear",
        .help = "Clear screen",
        .hint = NULL,
        .func = &cmd_clear,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&clear_cmd));
    
    const esp_console_cmd_t history_cmd = {
        .command = "history",
        .help = "Show command history",
        .hint = NULL,
        .func = &cmd_show_history,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&history_cmd));
    
    const esp_console_cmd_t df_cmd = {
        .command = "df",
        .help = "Show disk space",
        .hint = NULL,
        .func = &cmd_df,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&df_cmd));
    
    const esp_console_cmd_t head_cmd = {
        .command = "head",
        .help = "Show first lines of file",
        .hint = "[-n lines] <file>",
        .func = &cmd_head,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&head_cmd));
    
    const esp_console_cmd_t tail_cmd = {
        .command = "tail",
        .help = "Show last lines of file",
        .hint = "[-n lines] <file>",
        .func = &cmd_tail,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&tail_cmd));
    
    const esp_console_cmd_t help_cmd = {
        .command = "help",
        .help = "Show all available commands",
        .hint = NULL,
        .func = &cmd_help,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&help_cmd));
}

static int cmd_load_from_sd(int argc, char **argv) {
    if (!sd_mounted) {
        printf("SD card not mounted. Use 'sdmount' first.\n");
        return 1;
    }
    if (argc < 2) {
        printf("Usage: loadsd <filename> [address]\n");
        printf("Example: loadsd program.bin\n");
        printf("Example: loadsd program.bin 1000\n");
        return 1;
    }

    char filepath[300];
    if (argv[1][0] == '/') {
        snprintf(filepath, sizeof(filepath), "%s", argv[1]);
    } else {
        snprintf(filepath, sizeof(filepath), "/sdcard/%s", argv[1]);
    }

    uint32_t load_addr = 0x0000;
    if (argc >= 3) {
        load_addr = strtol(argv[2], NULL, 16);
    }

    FILE *file = fopen(filepath, "rb");
    if (file == NULL) {
        printf("Failed to open file: %s\n", filepath);
        return 1;
    }

    // Get file size
    fseek(file, 0, SEEK_END);
    long file_size = ftell(file);
    fseek(file, 0, SEEK_SET);

    if (file_size <= 0) {
        printf("Invalid file size: %ld\n", file_size);
        fclose(file);
        return 1;
    }

    if (file_size > 16 * 1024 * 1024) {
        printf("File too large: %ld bytes (max 16MB)\n", file_size);
        fclose(file);
        return 1;
    }

    // Allocate buffer and read file
    uint8_t *buffer = malloc(file_size);
    if (buffer == NULL) {
        printf("Failed to allocate %ld bytes\n", file_size);
        fclose(file);
        return 1;
    }

    size_t bytes_read = fread(buffer, 1, file_size, file);
    fclose(file);

    if (bytes_read != file_size) {
        printf("Failed to read file: got %d bytes, expected %ld\n", bytes_read, file_size);
        free(buffer);
        return 1;
    }

    // Load into emulator
    printf("Loading %s...\n", argv[1]);
    printf("  File size: %ld bytes\n", file_size);
    printf("  Load address: 0x%08lX\n", (unsigned long)load_addr);

    m68k_load_program(buffer, file_size, load_addr);
    free(buffer);

    printf("Program loaded successfully!\n");
    printf("Use 'reset' to start execution\n");

    return 0;
}

// Background task for loadrun - runs M68K continuously until halted
static void loadrun_task(void *arg) {
    printf("loadrun: M68K execution started\n");
    while (true) {
        m68k_run(1000);
        if (m68k_is_halted()) {
            printf("loadrun: M68K halted\n");
            break;
        }
        vTaskDelay(pdMS_TO_TICKS(1));
    }
    printf("loadrun: task ended\n");
    vTaskDelete(NULL);
}

// Helper: detect M68K vector table in first 8 bytes (big-endian SP at 0, PC at 4)
static bool detect_vector_table(const uint8_t *data, uint32_t size, uint32_t *out_sp, uint32_t *out_pc) {
    if (size < 8) return false;

    // Read big-endian SP (bytes 0-3) and PC (bytes 4-7)
    uint32_t sp = ((uint32_t)data[0] << 24) | ((uint32_t)data[1] << 16) |
                  ((uint32_t)data[2] << 8)  | data[3];
    uint32_t pc = ((uint32_t)data[4] << 24) | ((uint32_t)data[5] << 16) |
                  ((uint32_t)data[6] << 8)  | data[7];

    // Heuristic: SP should be even, non-zero, within 16MB RAM
    // PC should be even, non-zero, within 16MB, and >= 8 (past vectors)
    if (sp == 0 || pc == 0) return false;
    if (sp & 1) return false;       // SP must be even
    if (pc & 1) return false;       // PC must be even
    if (sp > 0x01000000) return false; // SP within 16MB
    if (pc > 0x01000000) return false; // PC within 16MB
    if (pc < 8) return false;         // PC past vector table itself

    *out_sp = sp;
    *out_pc = pc;
    return true;
}

static int cmd_loadrun(int argc, char **argv) {
    if (!sd_mounted) {
        printf("SD card not mounted. Use 'sdmount' first.\n");
        return 1;
    }
    if (argc < 2) {
        printf("Usage: loadrun <filename> [addr]\n");
        printf("  Loads a M68K binary from SD card and immediately runs it.\n");
        printf("  Auto-detects vector table (SP+PC in first 8 bytes).\n");
        printf("  If no vector table: loads at [addr] (default 0x1000) and runs.\n");
        printf("Examples:\n");
        printf("  loadrun 3d_demo.bin       - vector table program\n");
        printf("  loadrun program.bin 1000  - raw code at 0x1000\n");
        return 1;
    }

