g91/esp32-p4-Domo-cpu-emulator/main/hello_world_main.c
    char filepath[300];
    if (argv[1][0] == '/') {
        snprintf(filepath, sizeof(filepath), "%s", argv[1]);
    } else {
        snprintf(filepath, sizeof(filepath), "/sdcard/%s", argv[1]);
    }

    // Default load address for non-vector-table programs
    uint32_t raw_load_addr = 0x1000;
    if (argc >= 3) {
        raw_load_addr = strtol(argv[2], NULL, 16);
    }

    FILE *file = fopen(filepath, "rb");
    if (file == NULL) {
        printf("Failed to open file: %s\n", filepath);
        return 1;
    }

    fseek(file, 0, SEEK_END);
    long file_size = ftell(file);
    fseek(file, 0, SEEK_SET);

    if (file_size <= 0 || file_size > 16 * 1024 * 1024) {
        printf("Invalid file size: %ld bytes\n", file_size);
        fclose(file);
        return 1;
    }

    uint8_t *buffer = malloc(file_size);
    if (buffer == NULL) {
        printf("Failed to allocate %ld bytes\n", file_size);
        fclose(file);
        return 1;
    }

    size_t bytes_read = fread(buffer, 1, file_size, file);
    fclose(file);

    if ((long)bytes_read != file_size) {
        printf("Failed to read file: got %d bytes, expected %ld\n", (int)bytes_read, file_size);
        free(buffer);
        return 1;
    }

    printf("Loaded %s (%ld bytes)\n", argv[1], file_size);

    // Detect vector table
    uint32_t init_sp = 0, init_pc = 0;
    bool has_vectors = detect_vector_table(buffer, (uint32_t)file_size, &init_sp, &init_pc);

    if (has_vectors) {
        printf("  Vector table detected: SP=0x%08lX PC=0x%08lX\n",
               (unsigned long)init_sp, (unsigned long)init_pc);
        // Load at address 0 (vectors + code together)
        m68k_load_program(buffer, file_size, 0x0000);
        free(buffer);

        // Reset CPU first (clears all state), then override SP/PC
        m68k_reset();
        // m68k_reset already reads vectors from address 0, which now contain our program's vectors.
        // But let's be explicit to ensure correctness:
        m68k_set_reg(M68K_REG_A7, init_sp);
        m68k_set_reg(M68K_REG_SP, init_sp);
        m68k_set_reg(M68K_REG_PC, init_pc);
        printf("  CPU reset: SP=0x%08lX PC=0x%08lX\n",
               (unsigned long)init_sp, (unsigned long)init_pc);
    } else {
        printf("  No vector table - loading at 0x%08lX\n", (unsigned long)raw_load_addr);
        m68k_load_program(buffer, file_size, raw_load_addr);
        free(buffer);

        // Don't do full reset (would read address 0 as SP/PC which may be garbage).
        // Just set PC to load address and SP to a reasonable default.
        m68k_set_reg(M68K_REG_A7, 0x00C00000);
        m68k_set_reg(M68K_REG_SP, 0x00C00000);
        m68k_set_reg(M68K_REG_PC, raw_load_addr);
        printf("  CPU: SP=0x00C00000 PC=0x%08lX\n", (unsigned long)raw_load_addr);
    }

    // Start execution in background task
    printf("Starting execution...\n");
    BaseType_t ret = xTaskCreate(
        loadrun_task,
        "loadrun",
        8192,
        NULL,
        5,
        NULL
    );

    if (ret != pdPASS) {
        printf("Failed to create execution task\n");
        return 1;
    }

    return 0;
}

static void register_m68k_commands(void) {
    const esp_console_cmd_t init_cmd = {
        .command = "init",
        .help = "Initialize the 68000 CPU",
        .hint = NULL,
        .func = &cmd_m68k_init,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&init_cmd));
    
    const esp_console_cmd_t reset_cmd = {
        .command = "reset",
        .help = "Reset the CPU and load vectors",
        .hint = NULL,
        .func = &cmd_m68k_reset,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&reset_cmd));
    
    const esp_console_cmd_t load_cmd = {
        .command = "load",
        .help = "Load example program into memory",
        .hint = NULL,
        .func = &cmd_m68k_load_example,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&load_cmd));
    
    const esp_console_cmd_t run_cmd = {
        .command = "run",
        .help = "Run N instructions",
        .hint = "<count>",
        .func = &cmd_m68k_run,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&run_cmd));
    
    const esp_console_cmd_t step_cmd = {
        .command = "step",
        .help = "Execute single instruction",
        .hint = NULL,
        .func = &cmd_m68k_step,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&step_cmd));
    
    const esp_console_cmd_t state_cmd = {
        .command = "state",
        .help = "Display CPU state (registers, flags)",
        .hint = NULL,
        .func = &cmd_m68k_state,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&state_cmd));
    
    const esp_console_cmd_t dump_cmd = {
        .command = "dump",
        .help = "Dump memory contents",
        .hint = "[addr] [length]",
        .func = &cmd_m68k_dump,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&dump_cmd));
    
    const esp_console_cmd_t crash_cmd = {
        .command = "crash",
        .help = "Show crash context and suggest memory dumps",
        .hint = NULL,
        .func = &cmd_m68k_crash,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&crash_cmd));
    
    const esp_console_cmd_t poke_cmd = {
        .command = "poke",
        .help = "Write byte to memory",
        .hint = "<addr> <value>",
        .func = &cmd_m68k_poke,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&poke_cmd));
    
    const esp_console_cmd_t sdmount_cmd = {
        .command = "sdmount",
        .help = "Mount SD card",
        .hint = NULL,
        .func = &cmd_sd_mount,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&sdmount_cmd));
    
    const esp_console_cmd_t sdunmount_cmd = {
        .command = "sdunmount",
        .help = "Unmount SD card",
        .hint = NULL,
        .func = &cmd_sd_unmount,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&sdunmount_cmd));
    
    // Note: 'ls' command is registered in register_linux_commands()
    
    const esp_console_cmd_t loadsd_cmd = {
        .command = "loadsd",
        .help = "Load 68000 program from SD card",
        .hint = "<filename> [addr]",
        .func = &cmd_load_from_sd,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&loadsd_cmd));

    const esp_console_cmd_t loadrun_cmd = {
        .command = "loadrun",
        .help = "Load & run M68K program (auto-detects vector table)",
        .hint = "<filename> [addr]",
        .func = &cmd_loadrun,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&loadrun_cmd));
}

static void initialize_console(void) {
    fflush(stdout);
    fsync(fileno(stdout));
    setvbuf(stdin, NULL, _IONBF, 0);

    uart_vfs_dev_port_set_rx_line_endings(CONFIG_ESP_CONSOLE_UART_NUM, ESP_LINE_ENDINGS_CR);
    uart_vfs_dev_port_set_tx_line_endings(CONFIG_ESP_CONSOLE_UART_NUM, ESP_LINE_ENDINGS_CRLF);

    const uart_config_t uart_config = {
        .baud_rate = CONFIG_ESP_CONSOLE_UART_BAUDRATE,
        .data_bits = UART_DATA_8_BITS,
        .parity = UART_PARITY_DISABLE,
        .stop_bits = UART_STOP_BITS_1,
        .source_clk = UART_SCLK_DEFAULT,
    };
    ESP_ERROR_CHECK(uart_driver_install(CONFIG_ESP_CONSOLE_UART_NUM, 256, 0, 0, NULL, 0));
    ESP_ERROR_CHECK(uart_param_config(CONFIG_ESP_CONSOLE_UART_NUM, &uart_config));
    uart_vfs_dev_use_driver(CONFIG_ESP_CONSOLE_UART_NUM);

    esp_console_config_t console_config = {
        .max_cmdline_length = 256,
        .max_cmdline_args = 8,
#if CONFIG_LOG_COLORS
        .hint_color = atoi(LOG_COLOR_CYAN)
#endif
    };
    ESP_ERROR_CHECK(esp_console_init(&console_config));

    linenoiseSetMultiLine(1);
    linenoiseSetCompletionCallback(&esp_console_get_completion);
    linenoiseSetHintsCallback((linenoiseHintsCallback*) &esp_console_get_hint);
    linenoiseHistorySetMaxLen(MAX_HISTORY_LINES);
    linenoiseSetMaxLineLen(console_config.max_cmdline_length);
    linenoiseAllowEmpty(false);
}

