g91/esp32-p4-Domo-cpu-emulator/main/hello_world_main.c
/* ====== WiFi Commands ====== */
// WiFi enabled for ESP32-P4-NANO with ESP32-C6 coprocessor via SDIO

static int cmd_wifi_scan(int argc, char **argv) {
    if (!wifi_initialized) {
        console_printf("✗ WiFi not initialized. Run 'help' for setup info.\n");
        return 1;
    }
    
    console_printf("Scanning for WiFi networks...\n");
    
    // Start WiFi scan
    esp_err_t ret = esp_wifi_scan_start(NULL, true);  // blocking scan
    if (ret != ESP_OK) {
        console_printf("✗ WiFi scan failed: %s\n", esp_err_to_name(ret));
        return 1;
    }
    
    // Get scan results
    uint16_t ap_count = 0;
    esp_wifi_scan_get_ap_num(&ap_count);
    
    if (ap_count == 0) {
        console_printf("No networks found.\n");
        return 0;
    }
    
    wifi_ap_record_t *ap_records = malloc(sizeof(wifi_ap_record_t) * ap_count);
    if (!ap_records) {
        console_printf("✗ Memory allocation failed\n");
        return 1;
    }
    
    ret = esp_wifi_scan_get_ap_records(&ap_count, ap_records);
    if (ret != ESP_OK) {
        console_printf("✗ Failed to get scan results: %s\n", esp_err_to_name(ret));
        free(ap_records);
        return 1;
    }
    
    console_printf("\nFound %d networks:\n", ap_count);
    console_printf("%-32s %-6s %-8s %-7s\n", "SSID", "RSSI", "Auth", "Channel");
    console_printf("%-32s %-6s %-8s %-7s\n", "--------------------------------", "------", "--------", "-------");
    
    for (int i = 0; i < ap_count; i++) {
        const char *auth_str = "Unknown";
        switch (ap_records[i].authmode) {
            case WIFI_AUTH_OPEN: auth_str = "Open"; break;
            case WIFI_AUTH_WEP: auth_str = "WEP"; break;
            case WIFI_AUTH_WPA_PSK: auth_str = "WPA"; break;
            case WIFI_AUTH_WPA2_PSK: auth_str = "WPA2"; break;
            case WIFI_AUTH_WPA3_PSK: auth_str = "WPA3"; break;
            default: auth_str = "Mixed"; break;
        }
        console_printf("%-32s %-6d %-8s %-7d\n", 
                     (char*)ap_records[i].ssid, ap_records[i].rssi, auth_str, ap_records[i].primary);
    }
    
    if (ap_count > 0) {
        console_printf("\nUse 'connect <ssid> <password>' to connect\n");
    } else {
        console_printf("✗ No networks found\n");
    }
    
    free(ap_records);
    return 0;
}

static int cmd_wifi_connect(int argc, char **argv) {
    if (argc < 3) {
        console_printf("Usage: connect <ssid> <password>\n");
        return 1;
    }
    
    const char *ssid = argv[1];
    const char *password = argv[2];
    
    console_printf("Connecting to '%s'...\n", ssid);
    s_wifi_retry_num = 0;  // Reset retry counter for manual connect
    
    // Configure WiFi station
    wifi_config_t wifi_config = {0};
    strncpy((char*)wifi_config.sta.ssid, ssid, sizeof(wifi_config.sta.ssid) - 1);
    strncpy((char*)wifi_config.sta.password, password, sizeof(wifi_config.sta.password) - 1);
    
    // Set WiFi mode to station
    esp_err_t ret = esp_wifi_set_mode(WIFI_MODE_STA);
    if (ret != ESP_OK) {
        console_printf("✗ Failed to set WiFi mode: %s\n", esp_err_to_name(ret));
        return 1;
    }
    
    ret = esp_wifi_set_config(WIFI_IF_STA, &wifi_config);
    if (ret != ESP_OK) {
        console_printf("✗ Failed to set WiFi config: %s\n", esp_err_to_name(ret));
        return 1;
    }
    
    ret = esp_wifi_connect();
    if (ret != ESP_OK) {
        console_printf("✗ Connection request failed: %s\n", esp_err_to_name(ret));
        return 1;
    }
    
    console_printf("✓ Connection initiated - check status with 'wifistatus'\n");
    return 0;
}

static int cmd_wifi_status(int argc, char **argv) {
    wifi_ap_record_t ap_info;
    esp_err_t ret = esp_wifi_sta_get_ap_info(&ap_info);
    
    if (ret == ESP_OK) {
        console_printf("WiFi Status: ✓ Connected\n");
        console_printf("  SSID: %s\n", ap_info.ssid);
        console_printf("  Signal strength: %d dBm\n", ap_info.rssi);
        console_printf("  Channel: %d\n", ap_info.primary);
        
        // Get IP address
        esp_netif_t *netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
        if (netif) {
            esp_netif_ip_info_t ip_info;
            if (esp_netif_get_ip_info(netif, &ip_info) == ESP_OK) {
                console_printf("  IP address: " IPSTR "\n", IP2STR(&ip_info.ip));
                console_printf("  Netmask: " IPSTR "\n", IP2STR(&ip_info.netmask));
                console_printf("  Gateway: " IPSTR "\n", IP2STR(&ip_info.gw));
            }
        }
    } else if (ret == ESP_ERR_WIFI_NOT_CONNECT) {
        console_printf("WiFi Status: Disconnected\n");
    } else {
        console_printf("WiFi Status: Unknown (error: %s)\n", esp_err_to_name(ret));
    }
    
    // Also show Ethernet status
    if (ethernet_initialized) {
        if (ethernet_is_link_up()) {
            console_printf("Ethernet: ✓ Link Up\n");
            if (ethernet_is_connected()) {
                char eth_ip[16];
                if (ethernet_get_ip(eth_ip, sizeof(eth_ip)) == ESP_OK) {
                    console_printf("  IP address: %s\n", eth_ip);
                }
            } else {
                console_printf("  IP: Waiting for DHCP...\n");
            }
        } else {
            console_printf("Ethernet: ✗ Link Down (no cable)\n");
        }
    }
    
    return 0;
}


static int cmd_wifi_disconnect(int argc, char **argv) {
    console_printf("Disconnecting from WiFi...\n");
    esp_err_t ret = esp_wifi_disconnect();
    if (ret == ESP_OK) {
        console_printf("✓ Disconnected\n");
    } else {
        console_printf("✗ Disconnect failed: %s\n", esp_err_to_name(ret));
    }
    
    return 0;
}

static int cmd_ipconfig(int argc, char **argv) {
    console_printf("\n=== Network Configuration ===\n\n");
    
    // --- WiFi Interface ---
    console_printf("--- WiFi (ESP32-C6 SDIO) ---\n");
    esp_netif_t *wifi_netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    if (wifi_netif) {
        uint8_t mac[6];
        if (esp_netif_get_mac(wifi_netif, mac) == ESP_OK) {
            console_printf("  MAC:     %02X:%02X:%02X:%02X:%02X:%02X\n",
                mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
        }
        
        wifi_ap_record_t ap_info;
        esp_err_t ret = esp_wifi_sta_get_ap_info(&ap_info);
        if (ret == ESP_OK) {
            console_printf("  Status:  ✓ Connected to '%s'\n", ap_info.ssid);
            console_printf("  Signal:  %d dBm (Ch %d)\n", ap_info.rssi, ap_info.primary);
            
