g91/esp32-p4-Domo-cpu-emulator/main/hello_world_main.c
            esp_netif_ip_info_t wifi_ip;
            if (esp_netif_get_ip_info(wifi_netif, &wifi_ip) == ESP_OK && wifi_ip.ip.addr != 0) {
                console_printf("  IP:      " IPSTR "\n", IP2STR(&wifi_ip.ip));
                console_printf("  Netmask: " IPSTR "\n", IP2STR(&wifi_ip.netmask));
                console_printf("  Gateway: " IPSTR "\n", IP2STR(&wifi_ip.gw));
            } else {
                console_printf("  IP:      Waiting for DHCP...\n");
            }
        } else {
            console_printf("  Status:  ✗ Disconnected\n");
        }
    } else {
        console_printf("  Status:  Not initialized\n");
    }
    
    // --- Ethernet Interface ---
    console_printf("\n--- Ethernet (RJ45 100M) ---\n");
    if (ethernet_initialized) {
        esp_netif_t *eth_netif = ethernet_get_netif();
        if (eth_netif) {
            uint8_t mac[6];
            if (esp_netif_get_mac(eth_netif, mac) == ESP_OK) {
                console_printf("  MAC:     %02X:%02X:%02X:%02X:%02X:%02X\n",
                    mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
            }
            
            if (ethernet_is_link_up()) {
                console_printf("  Link:    ✓ Up\n");
                if (ethernet_is_connected()) {
                    esp_netif_ip_info_t eth_ip;
                    if (esp_netif_get_ip_info(eth_netif, &eth_ip) == ESP_OK && eth_ip.ip.addr != 0) {
                        console_printf("  IP:      " IPSTR "\n", IP2STR(&eth_ip.ip));
                        console_printf("  Netmask: " IPSTR "\n", IP2STR(&eth_ip.netmask));
                        console_printf("  Gateway: " IPSTR "\n", IP2STR(&eth_ip.gw));
                    }
                } else {
                    console_printf("  IP:      Waiting for DHCP...\n");
                }
            } else {
                console_printf("  Link:    ✗ Down (no cable?)\n");
            }
        }
    } else {
        console_printf("  Status:  Not initialized\n");
    }
    
    // --- Services ---
    console_printf("\n--- Services ---\n");
    if (ftp_server_is_running()) {
        // Show FTP on whichever interface has IP
        char ftp_ip[16] = "0.0.0.0";
        if (wifi_connected) {
            esp_netif_ip_info_t wifi_ip;
            if (wifi_netif && esp_netif_get_ip_info(wifi_netif, &wifi_ip) == ESP_OK) {
                snprintf(ftp_ip, sizeof(ftp_ip), IPSTR, IP2STR(&wifi_ip.ip));
            }
        } else if (ethernet_is_connected()) {
            ethernet_get_ip(ftp_ip, sizeof(ftp_ip));
        }
        console_printf("  FTP:     Running at ftp://%s:21\n", ftp_ip);
    } else {
        console_printf("  FTP:     Not running\n");
    }
    console_printf("\n");
    
    return 0;
}

static int cmd_ftp_start(int argc, char **argv) {
    if (!wifi_is_connected()) {
        console_printf("✗ WiFi not connected. Connect to WiFi first.\n");
        return 1;
    }
    
    if (ftp_server_is_running()) {
        console_printf("✓ FTP server is already running\n");
        return 0;
    }
    
    esp_err_t ret = ftp_server_init();
    if (ret == ESP_OK) {
        char ip_str[16];
        wifi_get_ip(ip_str, sizeof(ip_str));
        console_printf("✓ FTP server started\n");
        console_printf("  Address: ftp://%s:21\n", ip_str);
        console_printf("  Root: /sdcard\n");
        console_printf("  Username: anonymous (any)\n");
        console_printf("  Password: (none)\n");
    } else {
        console_printf("✗ Failed to start FTP server: %s\n", esp_err_to_name(ret));
    }
    
    return 0;
}

static int cmd_ftp_stop(int argc, char **argv) {
    if (!ftp_server_is_running()) {
        console_printf("FTP server is not running\n");
        return 0;
    }
    
    ftp_server_stop();
    console_printf("✓ FTP server stopped\n");
    return 0;
}

static int cmd_ftp_status(int argc, char **argv) {
    if (ftp_server_is_running()) {
        char ip_str[16];
        if (wifi_get_ip(ip_str, sizeof(ip_str)) == ESP_OK) {
            console_printf("✓ FTP server running\n");
            console_printf("  Address: ftp://%s:21\n", ip_str);
            console_printf("  Root: /sdcard\n");
        } else {
            console_printf("✓ FTP server running (IP unavailable)\n");
        }
    } else {
        console_printf("FTP server is not running\n");
        console_printf("Use 'ftpstart' to start the server\n");
    }
    return 0;
}

// WiFi command registration enabled
static void register_wifi_ftp_commands(void) {
    const esp_console_cmd_t wifi_scan_cmd = {
        .command = "scan",
        .help = "Scan for WiFi networks",
        .hint = NULL,
        .func = &cmd_wifi_scan,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&wifi_scan_cmd));
    
    const esp_console_cmd_t wifi_connect_cmd = {
        .command = "connect",
        .help = "Connect to WiFi network",
        .hint = "<ssid> <password>",
        .func = &cmd_wifi_connect,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&wifi_connect_cmd));
    
    const esp_console_cmd_t wifi_status_cmd = {
        .command = "status",
        .help = "Show WiFi status",
        .hint = NULL,
        .func = &cmd_wifi_status,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&wifi_status_cmd));
    
    const esp_console_cmd_t wifi_disconnect_cmd = {
        .command = "disconnect",
        .help = "Disconnect from WiFi",
        .hint = NULL,
        .func = &cmd_wifi_disconnect,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&wifi_disconnect_cmd));
    
    const esp_console_cmd_t ipconfig_cmd = {
        .command = "ipconfig",
        .help = "Show network configuration",
        .hint = NULL,
        .func = &cmd_ipconfig,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&ipconfig_cmd));
    
    // FTP commands
    const esp_console_cmd_t ftp_start_cmd = {
        .command = "ftpstart",
        .help = "Start FTP server",
        .hint = NULL,
        .func = &cmd_ftp_start,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&ftp_start_cmd));
    
