g91/esp32-p4-Domo-cpu-emulator/main/hello_world_main.c
    const esp_console_cmd_t ftp_stop_cmd = {
        .command = "ftpstop",
        .help = "Stop FTP server",
        .hint = NULL,
        .func = &cmd_ftp_stop,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&ftp_stop_cmd));
    
    const esp_console_cmd_t ftp_status_cmd = {
        .command = "ftpstatus",
        .help = "Show FTP server status",
        .hint = NULL,
        .func = &cmd_ftp_status,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&ftp_status_cmd));
}
// WiFi/FTP commands enabled

/* ====== Application Loader Commands ====== */

static int cmd_run_m68k(int argc, char **argv) {
    if (argc < 2) {
        console_printf("Usage: runm68k <filename>\n");
        console_printf("Load and run M68K binary from SD card\n");
        return 1;
    }
    
    const char *filename = argv[1];
    console_printf("Loading M68K app: %s\n", filename);
    
    esp_err_t ret = app_run_m68k(filename);
    if (ret == ESP_OK) {
        console_printf("✓ M68K application loaded\n");
        console_printf("  Network access: Available via 0x%08X\n", BUS_IO_BASE);
        console_printf("  Use 'step' or 'run' to execute\n");
    } else {
        console_printf("✗ Failed to load M68K app: %s\n", esp_err_to_name(ret));
        return 1;
    }
    
    return 0;
}

static int cmd_appinfo(int argc, char **argv) {
    application_t *app = app_get_current();
    if (!app || !app->running) {
        console_printf("No application running\n");
        return 0;
    }
    
    console_printf("Current Application:\n");
    console_printf("  Name: %s\n", app->name);
    console_printf("  Type: %s\n", app->type == APP_TYPE_M68K ? "M68K" : "ARM Native");
    console_printf("  Entry: 0x%08lX\n", (unsigned long)app->entry_point);
    console_printf("  Stack: %lu KB\n", (unsigned long)(app->stack_size / 1024));
    console_printf("  Status: %s\n", app->running ? "Running" : "Stopped");
    
    if (app->type == APP_TYPE_M68K) {
        console_printf("\nNetwork device at: 0x%08X\n", BUS_IO_BASE);
        console_printf("  Commands: socket, bind, connect, send, recv\n");
        console_printf("  DMA at: 0x%08X\n", BUS_IO_BASE + BUS_DEV_DMA);
    }
    
    return 0;
}

/* ====== i8086 PC Emulator Commands ====== */

static int cmd_init86(int argc, char **argv) {
    if (i86_is_initialized()) {
        console_printf("i8086 already initialized\n");
        return 0;
    }
    
    esp_err_t ret = i86_init(NULL);
    if (ret == ESP_OK) {
        console_printf("✓ i8086 PC emulator initialized\n");
        console_printf("  640KB RAM, 128KB video memory\n");
        console_printf("  Use 'mount' to attach disk images\n");
        console_printf("  Use 'run86' to boot from disk\n");
    } else {
        console_printf("✗ Failed to initialize: %s\n", esp_err_to_name(ret));
    }
    return 0;
}

static int cmd_reset86(int argc, char **argv) {
    if (!i86_is_initialized()) {
        console_printf("i8086 not initialized. Use 'init86' first.\n");
        return 1;
    }
    
    i86_reset();
    console_printf("i8086 CPU reset\n");
    return 0;
}

static int cmd_state86(int argc, char **argv) {
    if (!i86_is_initialized()) {
        console_printf("i8086 not initialized\n");
        return 1;
    }
    
    char buffer[1024];
    i86_get_state_string(buffer, sizeof(buffer));
    console_printf("%s", buffer);
    return 0;
}

static int cmd_mount(int argc, char **argv) {
    if (argc < 3) {
        console_printf("Usage: mount <drive> <image>\n");
        console_printf("  drive: A, B, C, or D\n");
        console_printf("  image: path to .img file on SD card\n");
        console_printf("Example: mount A freedos.img\n");
        return 1;
    }
    
    char drive_letter = toupper(argv[1][0]);
    if (drive_letter < 'A' || drive_letter > 'D') {
        console_printf("Invalid drive: %c (must be A-D)\n", drive_letter);
        return 1;
    }
    
    uint8_t drive = drive_letter - 'A';
    const char *filename = argv[2];
    
    // Prepend /sdcard if not absolute path
    char fullpath[300];
    if (filename[0] != '/') {
        snprintf(fullpath, sizeof(fullpath), "/sdcard/%s", filename);
        filename = fullpath;
    }
    
    esp_err_t ret = disk_mount(drive, filename, false);
    if (ret == ESP_OK) {
        disk_info_t info;
        disk_get_info(drive, &info);
        console_printf("✓ Mounted %c: %s\n", drive_letter, info.filename);
        console_printf("  Type: %s\n", disk_type_name(info.type));
        console_printf("  Size: %llu KB\n", info.size_bytes / 1024);
    } else {
        console_printf("✗ Mount failed: %s\n", esp_err_to_name(ret));
    }
    
    return 0;
}

static int cmd_unmount(int argc, char **argv) {
    if (argc < 2) {
        console_printf("Usage: unmount <drive>\n");
        return 1;
    }
    
    char drive_letter = toupper(argv[1][0]);
    if (drive_letter < 'A' || drive_letter > 'D') {
        console_printf("Invalid drive\n");
        return 1;
    }
    
    uint8_t drive = drive_letter - 'A';
    disk_unmount(drive);
    console_printf("Drive %c: unmounted\n", drive_letter);
    return 0;
}

static int cmd_disks(int argc, char **argv) {
    char buffer[1024];
    disk_list(buffer, sizeof(buffer));
    console_printf("%s", buffer);
    return 0;
}

static int cmd_mkdisk(int argc, char **argv) {
    if (argc < 3) {
        console_printf("Usage: mkdisk <filename> <type>\n");
        console_printf("Types:\n");
        console_printf("  360  - 360KB floppy\n");
        console_printf("  720  - 720KB floppy\n");
        console_printf("  1.2  - 1.2MB floppy\n");
        console_printf("  1.44 - 1.44MB floppy (default)\n");
        console_printf("  2.88 - 2.88MB floppy\n");
        console_printf("  hd:N - Hard disk, N MB (e.g., hd:10)\n");
        console_printf("Example: mkdisk boot.img 1.44\n");
        return 1;
    }
    
    const char *filename = argv[1];
    const char *type_str = argv[2];
    
    // Prepend /sdcard if not absolute
    char fullpath[300];
    if (filename[0] != '/') {
        snprintf(fullpath, sizeof(fullpath), "/sdcard/%s", filename);
        filename = fullpath;
    }
    
    esp_err_t ret = ESP_FAIL;
    
    if (strncmp(type_str, "hd:", 3) == 0) {
        // Hard disk
        uint32_t size_mb = atoi(type_str + 3);
        if (size_mb == 0 || size_mb > 2048) {
            console_printf("Invalid HD size (1-2048 MB)\n");
            return 1;
        }
        ret = disk_create_hd_image(filename, size_mb);
    } else {
        // Floppy
        disk_type_t type = DISK_TYPE_FLOPPY_1M44; // default
        
        if (strcmp(type_str, "360") == 0) type = DISK_TYPE_FLOPPY_360K;
        else if (strcmp(type_str, "720") == 0) type = DISK_TYPE_FLOPPY_720K;
        else if (strcmp(type_str, "1.2") == 0) type = DISK_TYPE_FLOPPY_1M2;
        else if (strcmp(type_str, "1.44") == 0) type = DISK_TYPE_FLOPPY_1M44;
        else if (strcmp(type_str, "2.88") == 0) type = DISK_TYPE_FLOPPY_2M88;
        else {
            console_printf("Unknown type: %s\n", type_str);
            return 1;
        }
        
