g91/esp32-p4-Domo-cpu-emulator/main/hello_world_main.c
        ret = disk_create_image(filename, type);
    }
    
    if (ret == ESP_OK) {
        console_printf("✓ Created %s\n", filename);
        console_printf("Use 'mount A %s' to attach it\n", filename);
    } else {
        console_printf("✗ Failed to create image\n");
    }
    
    return 0;
}

static int cmd_switch(int argc, char **argv) {
    if (argc < 2) {
        const char *name = "M68K";
        if (active_cpu == ACTIVE_CPU_I8086) name = "i8086";
        else if (active_cpu == ACTIVE_CPU_6502) name = "6502";
        else if (active_cpu == ACTIVE_CPU_APPLE2E) name = "Apple IIe";
        else if (active_cpu == ACTIVE_CPU_C128) name = "C128";
        else if (active_cpu == ACTIVE_CPU_Z80) name = "Z80 CP/M";
        console_printf("Current CPU: %s\n", name);
        console_printf("Usage: switch <m68k|i8086|6502|apple2e|c128|z80>\n");
        return 0;
    }

    if (strcasecmp(argv[1], "m68k") == 0) {
        active_cpu = ACTIVE_CPU_M68K;
        console_printf("Switched to M68K emulator\n");
    } else if (strcasecmp(argv[1], "i8086") == 0 || strcasecmp(argv[1], "86") == 0) {
        active_cpu = ACTIVE_CPU_I8086;
        console_printf("Switched to i8086 emulator\n");
    } else if (strcasecmp(argv[1], "6502") == 0) {
        active_cpu = ACTIVE_CPU_6502;
        console_printf("Switched to MOS 6502 emulator\n");
    } else if (strcasecmp(argv[1], "apple2e") == 0 || strcasecmp(argv[1], "apple2") == 0 || strcasecmp(argv[1], "a2") == 0) {
        active_cpu = ACTIVE_CPU_APPLE2E;
        console_printf("Switched to Apple IIe emulator\n");
    } else if (strcasecmp(argv[1], "c128") == 0 || strcasecmp(argv[1], "128") == 0) {
        active_cpu = ACTIVE_CPU_C128;
        console_printf("Switched to Commodore 128 emulator\n");
    } else if (strcasecmp(argv[1], "z80") == 0 || strcasecmp(argv[1], "cpm") == 0) {
        active_cpu = ACTIVE_CPU_Z80;
        console_printf("Switched to Z80 CP/M emulator\n");
    } else {
        console_printf("Unknown CPU: %s\n", argv[1]);
        return 1;
    }
    
    return 0;
}

static int cmd_run86(int argc, char **argv) {
    if (!i86_is_initialized()) {
        console_printf("i8086 not initialized. Use 'init86' first.\n");
        return 1;
    }
    
    // Parse optional cycle count
    uint32_t count = 0;  // 0 = run continuously
    if (argc >= 2) {
        count = strtoul(argv[1], NULL, 0);
    }
    
    if (count > 0) {
        // Run a specific number of instructions
        console_printf("Running %lu i8086 instructions...\n", (unsigned long)count);
        uint32_t executed = i86_run(count);
        console_printf("Executed %lu instructions.\n", (unsigned long)executed);
    } else {
        // Boot and run continuously
        console_printf("Booting i8086 PC emulator...\n");
        console_printf("Press Ctrl+C to stop.\n\n");
        i86_boot_and_run();
    }
    
    return 0;
}

static void i86_run_task(void *arg) {
    i86_boot_and_run();
    s_i86_task_handle = NULL;
    vTaskDelete(NULL);
}

// ---- ESP32 Native OS task ----

static void esp32os_run_task(void *arg) {
    esp32_os_run(arg);
    printf("ESP32 Native OS exited.\n");
    s_esp32os_task_handle = NULL;
    vTaskDelete(NULL);
}

// ---- Atari ST emulator task and commands ----

static void atari_st_run_task(void *arg) {
    atari_st_run();  // Runs until stopped (Ctrl+C or atari_st_stop())
    atari_st_destroy();
    printf("Atari ST emulator exited.\n");
    s_atari_task_handle = NULL;
    vTaskDelete(NULL);
}

static int cmd_stop_atari(int argc, char **argv) {
    if (!atari_st_is_running()) {
        console_printf("Atari ST is not running.\n");
        return 1;
    }
    atari_st_stop();
    console_printf("Atari ST emulator stopping...\n");
    return 0;
}

static int cmd_state_atari(int argc, char **argv) {
    char buf[512];
    atari_st_get_state(buf, sizeof(buf));
    console_printf("%s", buf);
    return 0;
}

// ---- Amiga emulator task and commands ----
static void amiga_run_task(void *arg) {
    amiga_run();  // Runs until stopped (Ctrl+C or amiga_stop())
    amiga_destroy();
    printf("Amiga emulator exited.\n");
    s_amiga_task_handle = NULL;
    vTaskDelete(NULL);
}

static int cmd_stop_amiga(int argc, char **argv) {
    if (!amiga_is_running()) {
        console_printf("Amiga is not running.\n");
        return 1;
    }
    amiga_stop();
    console_printf("Amiga emulator stopping...\n");
    return 0;
}

static int cmd_state_amiga(int argc, char **argv) {
    char buf[512];
    amiga_get_state(buf, sizeof(buf));
    console_printf("%s", buf);
    return 0;
}

static int cmd_amiga_floppy(int argc, char **argv) {
    if (argc < 2) {
        console_printf("Usage: amigafloppy <path> [drive]\n");
        console_printf("  drive: 0-3 (default 0)\n");
        return 1;
    }
    int drive = 0;
    if (argc >= 3) {
        drive = atoi(argv[2]);
        if (drive < 0 || drive > 3) {
            console_printf("Invalid drive number (0-3)\n");
            return 1;
        }
    }
    if (strcmp(argv[1], "eject") == 0) {
        amiga_eject_floppy(drive);
        console_printf("Ejected floppy from DF%d\n", drive);
        return 0;
    }
    esp_err_t ret = amiga_insert_floppy(drive, argv[1]);
    if (ret == ESP_OK) {
        console_printf("Inserted %s in DF%d\n", argv[1], drive);
    } else {
        console_printf("Failed to insert floppy: %s\n", esp_err_to_name(ret));
    }
    return (ret == ESP_OK) ? 0 : 1;
}

static int cmd_amiga_hdf(int argc, char **argv) {
    if (argc < 2) {
        console_printf("Usage: amigahdf <path> [unit]\n");
        console_printf("  unit: 0-1 (default 0)\n");
        return 1;
    }
    int unit = 0;
    if (argc >= 3) {
        unit = atoi(argv[2]);
        if (unit < 0 || unit > 1) {
            console_printf("Invalid unit number (0-1)\n");
            return 1;
        }
    }
    if (strcmp(argv[1], "eject") == 0) {
        amiga_unmount_hdf(unit);
        console_printf("Unmounted HDF from unit %d\n", unit);
        return 0;
    }
    esp_err_t ret = amiga_mount_hdf(unit, argv[1]);
    if (ret == ESP_OK) {
        console_printf("Mounted %s as HD%d\n", argv[1], unit);
    } else {
        console_printf("Failed to mount HDF: %s\n", esp_err_to_name(ret));
    }
    return (ret == ESP_OK) ? 0 : 1;
}

