g91/esp32-p4-Domo-cpu-emulator/main/hello_world_main.c
static int cmd_boot86(int argc, char **argv) {
    if (!i86_is_initialized()) {
        // Auto-initialize
        i86_config_t config = {
            .ram_size = I86_RAM_SIZE,
            .cpu_freq_mhz = 8,
            .enable_fpu = false,
            .enable_sound = false,
            .boot_disk = NULL,
        };
        if (i86_init(&config) != ESP_OK) {
            console_printf("Failed to initialize i8086.\n");
            return 1;
        }
    }
    
    // Check if a disk image argument is provided
    if (argc >= 2) {
        const char *disk_path = argv[1];
        // Auto-mount as drive A: or C: depending on type
        disk_type_t type = disk_detect_type(disk_path);
        int drive = (type == DISK_TYPE_HARD_DISK) ? 2 : 0;
        
        if (i86_mount_disk(drive, disk_path) != ESP_OK) {
            console_printf("Failed to mount disk: %s\n", disk_path);
            return 1;
        }
        console_printf("Mounted %s as drive %c:\n", disk_path,
                       drive < 2 ? 'A' + drive : 'C' + (drive - 2));
    }
    
    // Check at least one disk is mounted
    bool any_disk = false;
    for (int i = 0; i < MAX_DISK_DRIVES; i++) {
        if (disk_is_mounted(i)) {
            any_disk = true;
            break;
        }
    }
    if (!any_disk) {
        console_printf("No disk mounted. Usage: boot86 <disk_image.img>\n");
        console_printf("Or mount a disk first: mount A /sdcard/freedos.img\n");
        return 1;
    }
    
    if (s_i86_task_handle != NULL) {
        console_printf("i8086 emulator is already running.\n");
        return 1;
    }
    
    // Run in a FreeRTOS task
    console_printf("Starting i8086 PC emulator...\n");
    BaseType_t ret = xTaskCreate(i86_run_task, "i8086_emu", 16384, NULL, 5, &s_i86_task_handle);
    if (ret != pdPASS) {
        console_printf("Failed to create emulator task.\n");
        return 1;
    }
    
    return 0;
}

static int cmd_stop86(int argc, char **argv) {
    if (!i86_is_initialized()) {
        console_printf("i8086 not initialized.\n");
        return 1;
    }
    i86_stop();
    console_printf("i8086 emulator stopped.\n");
    return 0;
}

static void register_i8086_commands(void) {
    const esp_console_cmd_t init86_cmd = {
        .command = "init86",
        .help = "Initialize i8086 PC emulator",
        .hint = NULL,
        .func = &cmd_init86,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&init86_cmd));
    
    const esp_console_cmd_t reset86_cmd = {
        .command = "reset86",
        .help = "Reset i8086 CPU",
        .hint = NULL,
        .func = &cmd_reset86,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&reset86_cmd));
    
    const esp_console_cmd_t state86_cmd = {
        .command = "state86",
        .help = "Show i8086 CPU state",
        .hint = NULL,
        .func = &cmd_state86,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&state86_cmd));
    
    const esp_console_cmd_t mount_cmd = {
        .command = "mount",
        .help = "Mount disk image",
        .hint = "<drive> <image>",
        .func = &cmd_mount,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&mount_cmd));
    
    const esp_console_cmd_t unmount_cmd = {
        .command = "unmount",
        .help = "Unmount disk",
        .hint = "<drive>",
        .func = &cmd_unmount,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&unmount_cmd));
    
    const esp_console_cmd_t disks_cmd = {
        .command = "disks",
        .help = "List mounted disks",
        .hint = NULL,
        .func = &cmd_disks,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&disks_cmd));
    
    const esp_console_cmd_t mkdisk_cmd = {
        .command = "mkdisk",
        .help = "Create blank disk image",
        .hint = "<filename> <type>",
        .func = &cmd_mkdisk,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&mkdisk_cmd));
    
    const esp_console_cmd_t switch_cmd = {
        .command = "switch",
        .help = "Switch active CPU",
        .hint = "<m68k|i8086>",
        .func = &cmd_switch,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&switch_cmd));
    
    const esp_console_cmd_t run86_cmd = {
        .command = "run86",
        .help = "Run i8086 emulator [count]",
        .hint = "[instructions]",
        .func = &cmd_run86,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&run86_cmd));

    const esp_console_cmd_t boot86_cmd = {
        .command = "boot86",
        .help = "Boot i8086 PC from disk image",
        .hint = "[image_path]",
        .func = &cmd_boot86,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&boot86_cmd));

    const esp_console_cmd_t stop86_cmd = {
        .command = "stop86",
        .help = "Stop i8086 emulator",
        .hint = NULL,
        .func = &cmd_stop86,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&stop86_cmd));
}

// ============================================================================
// MOS 6502 Emulator Commands
// ============================================================================

static int cmd_init6502(int argc, char **argv) {
    esp_err_t err = mos6502_emu_init();
    if (err == ESP_OK) {
        console_printf("MOS 6502 emulator initialized (64KB RAM)\n");
    } else {
        console_printf("Failed to initialize 6502: %s\n", esp_err_to_name(err));
    }
    return 0;
}

static int cmd_reset6502(int argc, char **argv) {
    if (!mos6502_emu_is_initialized()) {
        console_printf("6502 not initialized. Run 'init6502' first.\n");
        return 1;
    }
    mos6502_emu_reset();
    char buf[256];
    mos6502_emu_get_state(buf, sizeof(buf));
    console_printf("%s", buf);
    return 0;
}

static int cmd_state6502(int argc, char **argv) {
    char buf[256];
    mos6502_emu_get_state(buf, sizeof(buf));
    console_printf("%s", buf);
    return 0;
}

static int cmd_step6502(int argc, char **argv) {
    if (!mos6502_emu_is_initialized()) {
        console_printf("6502 not initialized.\n");
        return 1;
    }
    mos6502_emu_step();
    char buf[256];
    mos6502_emu_get_state(buf, sizeof(buf));
    console_printf("%s", buf);
    return 0;
}

static int cmd_dump6502(int argc, char **argv) {
    uint32_t addr = 0;
    uint32_t len = 128;
    if (argc > 1) addr = strtoul(argv[1], NULL, 16);
    if (argc > 2) len = strtoul(argv[2], NULL, 0);
    mos6502_emu_dump_memory(addr, len);
    return 0;
}

