g91/esp32-p4-Domo-cpu-emulator/main/hello_world_main.c
static int cmd_load6502(int argc, char **argv) {
    if (argc < 2) {
        console_printf("Usage: load6502 <file> [address]\n");
        console_printf("  Loads binary file from SD card into 6502 memory\n");
        console_printf("  Default address: $E000 (ROM area)\n");
        return 1;
    }

    if (!mos6502_emu_is_initialized()) {
        console_printf("6502 not initialized. Running init6502...\n");
        mos6502_emu_init();
    }

    uint32_t load_addr = 0xE000;
    if (argc > 2) load_addr = strtoul(argv[2], NULL, 16);

    // Build path
    char path[128];
    if (argv[1][0] == '/') {
        snprintf(path, sizeof(path), "%s", argv[1]);
    } else {
        snprintf(path, sizeof(path), "/sdcard/%s", argv[1]);
    }

    FILE *f = fopen(path, "rb");
    if (!f) {
        console_printf("Cannot open file: %s\n", path);
        return 1;
    }

    fseek(f, 0, SEEK_END);
    long fsize = ftell(f);
    fseek(f, 0, SEEK_SET);

    uint8_t *buf = malloc(fsize);
    if (!buf) {
        console_printf("Out of memory for %ld bytes\n", fsize);
        fclose(f);
        return 1;
    }

    fread(buf, 1, fsize, f);
    fclose(f);

    mos6502_emu_load_program(buf, fsize, load_addr);
    free(buf);

    console_printf("Loaded %ld bytes from %s at $%04X\n", fsize, path, (uint16_t)load_addr);
    return 0;
}

static void mos6502_run_task(void *arg) {
    // C64 runs at ~1MHz. KERNAL boot takes ~1-2 seconds.
    // Suppress rendering during boot so the BASIC screen appears instantly.
    const uint32_t BATCH_INSTRUCTIONS = 500;
    const uint32_t BOOT_CYCLES = 2000000;  // ~2 seconds at 1MHz
    uint32_t total_cycles = 0;
    uint32_t cycles_since_render = 0;
    uint32_t poll_counter = 0;
    bool boot_complete = false;

    // Switch video card from TEXT mode to GFX mode so the C64 renderer
    // can use back-buffer drawing + present() for double-buffered output.
    // Without this, present() is a no-op and the LCD keeps showing the
    // text-mode welcome screen instead of the C64 display.
    if (video_card_is_initialized()) {
        video_card_enter_gfx_mode();
        video_card_present();  // Show initial black frame
    }

    // Phase 1: KERNAL boot - run CPU fast without rendering
    // This lets the BASIC startup message appear all at once
    while (!boot_complete) {
        uint64_t cycles = mos6502_emu_run(BATCH_INSTRUCTIONS);
        if (mos6502_emu_is_halted()) {
            printf("6502 halted during boot\n");
            goto task_exit;
        }
        // Note: mos6502_emu_tick() is called per-instruction inside
        // mos6502_emu_run() for C64/C128 modes (accurate raster timing)
        total_cycles += (uint32_t)cycles;

        // Yield every ~50k cycles so watchdog doesn't trigger
        cycles_since_render += (uint32_t)cycles;
        if (cycles_since_render >= 50000) {
            cycles_since_render = 0;
            vTaskDelay(pdMS_TO_TICKS(1));
        }

        if (total_cycles >= BOOT_CYCLES) {
            boot_complete = true;
        }
    }

    // Phase 2: Boot complete - render first frame instantly on both displays
    printf("\033[2J\033[H");  // Clear serial terminal
    fflush(stdout);
    mos6502_emu_render_screen();  // Full screen draw with BASIC prompt
    cycles_since_render = 0;

    // Phase 3: Normal operation - render at 60Hz, poll keyboard, handle input
    while (true) {
        uint64_t cycles = mos6502_emu_run(BATCH_INSTRUCTIONS);

        if (mos6502_emu_is_halted()) {
            printf("\033[27;1H6502 halted\n");
            break;
        }

        // Note: mos6502_emu_tick() is called per-instruction inside
        // mos6502_emu_run() for C64/C128 modes (accurate raster timing)
        cycles_since_render += (uint32_t)cycles;

        // Poll keyboard every ~4 batches
        if (++poll_counter >= 4) {
            poll_counter = 0;
            mos6502_emu_poll_keyboard();
            if (mos6502_emu_exit_requested()) {
                printf("\033[27;1H\nExiting C64 emulator...\n");
                fflush(stdout);
                break;
            }
        }

        // ~60Hz screen refresh
        if (cycles_since_render >= 16667) {
            cycles_since_render = 0;
            mos6502_emu_render_screen();
            vTaskDelay(pdMS_TO_TICKS(1));
        }
    }

task_exit:
    // Restore terminal
    printf("\033[2J\033[H");  // Clear screen
    printf("Returned to BIOS.\n");
    fflush(stdout);
    s_6502_task_handle = NULL;
    vTaskDelete(NULL);
}

// ============================================================================
// Apple IIe emulator run task
// ============================================================================
static void apple2e_run_task(void *arg) {
    const uint32_t BATCH_INSTRUCTIONS = 500;
    const uint32_t BOOT_CYCLES = 2000000;  // ~2 seconds at 1MHz
    uint32_t total_cycles = 0;
    uint32_t cycles_since_render = 0;
    uint32_t poll_counter = 0;
    bool boot_complete = false;

    // Switch video card to GFX mode for Apple II graphics
    if (video_card_is_initialized()) {
        video_card_enter_gfx_mode();
        video_card_present();
    }

    // Phase 1: Boot - run fast without rendering
    while (!boot_complete) {
        uint64_t cycles = apple2e_run(BATCH_INSTRUCTIONS);
        if (apple2e_is_halted()) {
            printf("Apple IIe halted during boot\n");
            goto a2_task_exit;
        }
        total_cycles += (uint32_t)cycles;
        cycles_since_render += (uint32_t)cycles;
        if (cycles_since_render >= 50000) {
            cycles_since_render = 0;
            vTaskDelay(pdMS_TO_TICKS(1));
        }
        if (total_cycles >= BOOT_CYCLES) {
            boot_complete = true;
        }
    }

    // Phase 2: First render
    printf("\033[2J\033[H");
    fflush(stdout);
    apple2e_render_screen();
    cycles_since_render = 0;

    // Phase 3: Normal 60Hz loop
    while (true) {
        uint64_t cycles = apple2e_run(BATCH_INSTRUCTIONS);
        if (apple2e_is_halted()) {
            printf("\033[27;1HApple IIe halted\n");
            break;
        }
        cycles_since_render += (uint32_t)cycles;

