g91/esp32-p4-Domo-cpu-emulator/main/hello_world_main.c
        if (++poll_counter >= 4) {
            poll_counter = 0;
            apple2e_poll_keyboard();
            if (apple2e_exit_requested()) {
                printf("\033[27;1H\nExiting Apple IIe...\n");
                fflush(stdout);
                break;
            }
        }

        if (cycles_since_render >= 16667) {
            cycles_since_render = 0;
            apple2e_render_screen();
            vTaskDelay(pdMS_TO_TICKS(1));
        }
    }

a2_task_exit:
    printf("\033[2J\033[H");
    printf("Returned to BIOS.\n");
    fflush(stdout);
    s_apple2e_task_handle = NULL;
    vTaskDelete(NULL);
}

static int cmd_run6502(int argc, char **argv) {
    if (!mos6502_emu_is_initialized()) {
        console_printf("6502 not initialized.\n");
        return 1;
    }

    if (argc > 1) {
        uint32_t count = strtoul(argv[1], NULL, 0);
        mos6502_emu_run(count);
        char buf[256];
        mos6502_emu_get_state(buf, sizeof(buf));
        console_printf("%s", buf);
    } else {
        if (s_6502_task_handle) {
            console_printf("6502 already running\n");
            return 0;
        }
        mos6502_emu_reset();
        xTaskCreate(mos6502_run_task, "6502_run", 8192, NULL, 5, &s_6502_task_handle);
        console_printf("6502 running in background\n");
    }
    return 0;
}

static int cmd_stop6502(int argc, char **argv) {
    if (s_6502_task_handle) {
        mos6502_emu_stop();
        console_printf("6502 stopped\n");
    } else {
        console_printf("6502 not running\n");
    }
    return 0;
}

static int cmd_poke6502(int argc, char **argv) {
    if (argc < 3) {
        console_printf("Usage: poke6502 <addr> <byte>\n");
        return 1;
    }
    uint16_t addr = (uint16_t)strtoul(argv[1], NULL, 16);
    uint8_t val = (uint8_t)strtoul(argv[2], NULL, 16);
    mos6502_emu_write_memory(addr, val);
    console_printf("$%04X = $%02X\n", addr, val);
    return 0;
}

// ============================================================================
// Video Card Commands
// ============================================================================

static int cmd_vinit(int argc, char **argv) {
    esp_err_t err = video_card_init();
    if (err == ESP_OK) {
        console_printf("Video card initialized (480x320, RGB565, double-buffered)\n");
    } else {
        console_printf("Failed to initialize video card: %s\n", esp_err_to_name(err));
    }
    return 0;
}

static int cmd_vtest(int argc, char **argv) {
    if (!video_card_is_initialized()) {
        console_printf("Video card not initialized. Run 'vinit' first.\n");
        return 1;
    }

    // Set mode and enable
    video_card_write(VID_REG_MODE, VID_MODE_480x320x16, 4);
    video_card_write(VID_REG_COMMAND, VID_CMD_INIT, 4);

    // Clear to dark blue
    video_card_write(VID_REG_BG_COLOR, 0x0011, 4);
    video_card_write(VID_REG_COMMAND, VID_CMD_CLEAR, 4);

    // Draw some shapes
    // Red filled rectangle
    video_card_write(VID_REG_DRAW_X, 20, 4);
    video_card_write(VID_REG_DRAW_Y, 20, 4);
    video_card_write(VID_REG_DRAW_W, 100, 4);
    video_card_write(VID_REG_DRAW_H, 80, 4);
    video_card_write(VID_REG_DRAW_COLOR, 0xF800, 4);
    video_card_write(VID_REG_COMMAND, VID_CMD_FILL_RECT, 4);

    // Green filled rectangle
    video_card_write(VID_REG_DRAW_X, 150, 4);
    video_card_write(VID_REG_DRAW_Y, 50, 4);
    video_card_write(VID_REG_DRAW_W, 80, 4);
    video_card_write(VID_REG_DRAW_H, 60, 4);
    video_card_write(VID_REG_DRAW_COLOR, 0x07E0, 4);
    video_card_write(VID_REG_COMMAND, VID_CMD_FILL_RECT, 4);

    // Blue circle
    video_card_write(VID_REG_DRAW_X, 350, 4);
    video_card_write(VID_REG_DRAW_Y, 160, 4);
    video_card_write(VID_REG_DRAW_W, 60, 4);
    video_card_write(VID_REG_DRAW_COLOR, 0x001F, 4);
    video_card_write(VID_REG_COMMAND, VID_CMD_FILL_CIRCLE, 4);

    // White diagonal lines
    for (int i = 0; i < 8; i++) {
        video_card_write(VID_REG_DRAW_X, 0, 4);
        video_card_write(VID_REG_DRAW_Y, i * 40, 4);
        video_card_write(VID_REG_DRAW_W, 479, 4);
        video_card_write(VID_REG_DRAW_H, 319 - i * 40, 4);
        video_card_write(VID_REG_DRAW_COLOR, 0xFFFF, 4);
        video_card_write(VID_REG_COMMAND, VID_CMD_DRAW_LINE, 4);
    }

    // Yellow horizontal line
    video_card_write(VID_REG_DRAW_X, 0, 4);
    video_card_write(VID_REG_DRAW_Y, 160, 4);
    video_card_write(VID_REG_DRAW_W, 480, 4);
    video_card_write(VID_REG_DRAW_COLOR, 0xFFE0, 4);
    video_card_write(VID_REG_COMMAND, VID_CMD_HLINE, 4);

    // Flip to display
    video_card_write(VID_REG_COMMAND, VID_CMD_FLIP, 4);

    console_printf("Video test pattern drawn\n");
    return 0;
}

static int cmd_vstatus(int argc, char **argv) {
    if (!video_card_is_initialized()) {
        console_printf("Video card: not initialized\n");
        return 0;
    }
    uint32_t status = video_card_read(VID_REG_STATUS, 4);
    uint32_t width = video_card_read(VID_REG_WIDTH, 4);
    uint32_t height = video_card_read(VID_REG_HEIGHT, 4);
    uint32_t frames = video_card_get_frame_count();

    console_printf("Video Card Status:\n");
    console_printf("  Resolution: %dx%d\n", width, height);
    console_printf("  Status: 0x%02X [%s%s%s]\n", status,
                   (status & VID_STATUS_READY) ? "READY " : "",
                   (status & VID_STATUS_VBLANK) ? "VBLANK " : "",
                   (status & VID_STATUS_GFX_MODE) ? "GFX" : "TEXT");
    console_printf("  Frames: %u\n", frames);
    return 0;
}

static int cmd_voff(int argc, char **argv) {
    if (video_card_is_initialized()) {
        video_card_deinit();
        console_printf("Video card disabled\n");
    } else {
        console_printf("Video card not active\n");
    }
    return 0;
}

// ============================================================================
// 6502 + Video Command Registration
// ============================================================================

static void register_6502_commands(void) {
    const esp_console_cmd_t cmds[] = {
        { .command = "init6502", .help = "Initialize MOS 6502 CPU emulator",
          .func = &cmd_init6502 },
        { .command = "reset6502", .help = "Reset 6502 CPU",
          .func = &cmd_reset6502 },
        { .command = "state6502", .help = "Show 6502 CPU state",
          .func = &cmd_state6502 },
        { .command = "step6502", .help = "Single-step 6502",
          .func = &cmd_step6502 },
        { .command = "run6502", .help = "Run 6502 [count] or continuously",
          .hint = "[count]", .func = &cmd_run6502 },
        { .command = "stop6502", .help = "Stop 6502 execution",
          .func = &cmd_stop6502 },
        { .command = "load6502", .help = "Load binary into 6502 memory",
          .hint = "<file> [addr]", .func = &cmd_load6502 },
        { .command = "dump6502", .help = "Dump 6502 memory",
          .hint = "[addr] [len]", .func = &cmd_dump6502 },
        { .command = "poke6502", .help = "Write byte to 6502 memory",
          .hint = "<addr> <byte>", .func = &cmd_poke6502 },
    };
    for (int i = 0; i < sizeof(cmds)/sizeof(cmds[0]); i++) {
        ESP_ERROR_CHECK(esp_console_cmd_register(&cmds[i]));
    }
}

// ============================================================================
// Apple IIe Commands
// ============================================================================

static int cmd_inita2(int argc, char **argv) {
    if (apple2e_is_initialized()) {
        console_printf("Apple IIe already initialized\n");
        return 0;
    }
    if (!video_card_is_initialized()) {
        video_card_init();
    }
    esp_err_t ret = apple2e_init();
    if (ret != ESP_OK) {
        console_printf("Init failed: %s\n", esp_err_to_name(ret));
        return 1;
    }
    apple2e_load_roms();
    apple2e_reset();
    console_printf("Apple IIe initialized and reset\n");
    return 0;
}

static int cmd_reseta2(int argc, char **argv) {
    if (!apple2e_is_initialized()) { console_printf("Apple IIe not initialized\n"); return 1; }
    apple2e_reset();
    console_printf("Apple IIe reset\n");
    return 0;
}

static int cmd_statea2(int argc, char **argv) {
    if (!apple2e_is_initialized()) { console_printf("Apple IIe not initialized\n"); return 1; }
    char buf[512];
    apple2e_get_state(buf, sizeof(buf));
    console_printf("%s", buf);
    return 0;
}

static int cmd_stepa2(int argc, char **argv) {
    if (!apple2e_is_initialized()) { console_printf("Apple IIe not initialized\n"); return 1; }
    apple2e_step();
    char buf[256];
    apple2e_get_state(buf, sizeof(buf));
    console_printf("%s", buf);
    return 0;
}

static int cmd_runa2(int argc, char **argv) {
    if (!apple2e_is_initialized()) { console_printf("Apple IIe not initialized\n"); return 1; }
    if (argc > 1) {
        uint32_t count = strtoul(argv[1], NULL, 0);
        apple2e_run(count);
        char buf[512];
        apple2e_get_state(buf, sizeof(buf));
        console_printf("%s", buf);
    } else {
        if (s_apple2e_task_handle) {
            console_printf("Apple IIe already running\n");
            return 0;
        }
        apple2e_reset();
        active_cpu = ACTIVE_CPU_APPLE2E;
        xTaskCreate(apple2e_run_task, "apple2e", 8192, NULL, 5, &s_apple2e_task_handle);
        console_printf("Apple IIe running in background\n");
    }
    return 0;
}

static int cmd_stopa2(int argc, char **argv) {
    if (s_apple2e_task_handle) {
        apple2e_stop();
        console_printf("Stopping Apple IIe...\n");
    } else {
        console_printf("Apple IIe not running\n");
    }
    return 0;
}

