g91/esp32-p4-Domo-cpu-emulator/main/hello_world_main.c
static int cmd_dumpa2(int argc, char **argv) {
    if (!apple2e_is_initialized()) { console_printf("Apple IIe not initialized\n"); return 1; }
    uint32_t addr = 0;
    uint32_t len = 256;
    if (argc > 1) addr = strtoul(argv[1], NULL, 16);
    if (argc > 2) len = strtoul(argv[2], NULL, 16);
    apple2e_dump_memory(addr, len);
    return 0;
}

static int cmd_a2disk(int argc, char **argv) {
    if (!apple2e_is_initialized()) { console_printf("Apple IIe not initialized\n"); return 1; }
    if (argc < 2) {
        console_printf("Usage: a2disk <path> [drive 0|1]\n");
        return 1;
    }
    int drive = 0;
    if (argc > 2) drive = atoi(argv[2]);
    esp_err_t ret = apple2e_mount_disk(drive, argv[1]);
    if (ret == ESP_OK) {
        console_printf("Disk mounted in drive %d\n", drive + 1);
    } else {
        console_printf("Failed to mount: %s\n", esp_err_to_name(ret));
    }
    return 0;
}

static void register_apple2e_commands(void) {
    const esp_console_cmd_t cmds[] = {
        { .command = "inita2",  .help = "Initialize Apple IIe emulator",
          .func = &cmd_inita2 },
        { .command = "reseta2", .help = "Reset Apple IIe",
          .func = &cmd_reseta2 },
        { .command = "statea2", .help = "Show Apple IIe state",
          .func = &cmd_statea2 },
        { .command = "stepa2",  .help = "Single-step Apple IIe",
          .func = &cmd_stepa2 },
        { .command = "runa2",   .help = "Run Apple IIe [count] or continuously",
          .hint = "[count]", .func = &cmd_runa2 },
        { .command = "stopa2",  .help = "Stop Apple IIe",
          .func = &cmd_stopa2 },
        { .command = "dumpa2",  .help = "Dump Apple IIe memory",
          .hint = "[addr] [len]", .func = &cmd_dumpa2 },
        { .command = "a2disk",  .help = "Mount disk image in Apple IIe",
          .hint = "<path> [drive]", .func = &cmd_a2disk },
    };
    for (int i = 0; i < sizeof(cmds)/sizeof(cmds[0]); i++) {
        ESP_ERROR_CHECK(esp_console_cmd_register(&cmds[i]));
    }
}

static void register_video_commands(void) {
    const esp_console_cmd_t cmds[] = {
        { .command = "vinit", .help = "Initialize video card (480x320 GPU)",
          .func = &cmd_vinit },
        { .command = "vtest", .help = "Draw video test pattern",
          .func = &cmd_vtest },
        { .command = "vstatus", .help = "Show video card status",
          .func = &cmd_vstatus },
        { .command = "voff", .help = "Disable video card",
          .func = &cmd_voff },
    };
    for (int i = 0; i < sizeof(cmds)/sizeof(cmds[0]); i++) {
        ESP_ERROR_CHECK(esp_console_cmd_register(&cmds[i]));
    }
}

static int cmd_appstop(int argc, char **argv) {
    application_t *app = app_get_current();
    if (!app || !app->running) {
        console_printf("No application running\n");
        return 0;
    }
    
    console_printf("Stopping application: %s\n", app->name);
    app_stop();
    console_printf("✓ Application stopped\n");
    
    return 0;
}

// ===== Bluetooth Commands =====
// ESP32-P4 uses ESP32-C6 coprocessor for Bluetooth via SDIO
// Using NimBLE stack with ESP-Hosted framework

static int cmd_btinit(int argc, char **argv) {
    if (bt_initialized) {
        console_printf("Bluetooth already initialized\n");
        return 0;
    }
    
    console_printf("Initializing Bluetooth (ESP32-C6 via SDIO)...\n");
    
    // Initialize NimBLE controller
    esp_err_t ret = nimble_port_init();
    if (ret != ESP_OK) {
        console_printf("✗ NimBLE port init failed: %s\n", esp_err_to_name(ret));
        return 1;
    }
    
    // Initialize NimBLE host stack
    ble_hs_cfg.sync_cb = NULL;  // No sync callback needed for scanning
    ble_hs_cfg.reset_cb = NULL; // No reset callback
    
    // Start NimBLE host task
    nimble_port_freertos_init(nimble_host_task);
    
    bt_initialized = true;
    console_printf("✓ Bluetooth initialized and ready\n");
    console_printf("  Mode: BLE (Bluetooth Low Energy) via NimBLE\n");
    console_printf("  Transport: ESP-Hosted over SDIO\n");
    console_printf("  Use 'btscan' to discover devices\n");
    
    return 0;
}

static int cmd_btscan(int argc, char **argv) {
    if (!bt_initialized) {
        console_printf("Bluetooth not initialized. Run 'btinit' first.\n");
        return 1;
    }
    
    if (bt_scanning) {
        console_printf("Scan already in progress...\n");
        return 1;
    }
    
    uint32_t duration_ms = 10000; // Default 10 seconds
    if (argc >= 2) {
        int duration = atoi(argv[1]);
        if (duration <= 0 || duration > 60) {
            console_printf("Invalid duration. Use 1-60 seconds.\n");
            return 1;
        }
        duration_ms = duration * 1000;
    }
    
    // Clear previous scan results
    memset(ble_devices, 0, sizeof(ble_devices));
    ble_device_count = 0;
    
    console_printf("Starting BLE scan for %lu seconds...\n", (unsigned long)(duration_ms/1000));
    
    // Configure scan parameters
    struct ble_gap_disc_params disc_params = {
        .itvl = 0x10,  // Scan interval: 10ms
        .window = 0x10, // Scan window: 10ms
        .filter_policy = 0,  // Accept all
        .limited = 0,  // Unlimited scan
        .passive = 0,  // Active scan
        .filter_duplicates = 0
    };
    
    // Start BLE discovery
    int rc = ble_gap_disc(BLE_OWN_ADDR_PUBLIC, duration_ms, &disc_params, gap_event_handler, NULL);
    if (rc != 0) {
        console_printf("✗ Failed to start BLE scan: %d\n", rc);
        return 1;
    }
    
    bt_scanning = true;
    
    // Wait for scan to complete
    console_printf("Scanning");
    for (uint32_t i = 0; i < duration_ms/1000; i++) {
        vTaskDelay(pdMS_TO_TICKS(1000));
        console_printf(".");
        fflush(stdout);
    }
    console_printf("\n");
    
    // Wait a bit more for completion event
    vTaskDelay(pdMS_TO_TICKS(500));
    
    // Display results
    console_printf("\n=== Discovered BLE Devices (%d) ===\n", ble_device_count);
    if (ble_device_count == 0) {
        console_printf("No devices found.\n");
        console_printf("Tips:\n");
        console_printf("  - Make sure device is powered on and advertising\n");
        console_printf("  - Try increasing scan duration: btscan 20\n");
    } else {
        for (int i = 0; i < ble_device_count; i++) {
            console_printf("%d. %s\n", i + 1, ble_devices[i].name);
            console_printf("   MAC: %02X:%02X:%02X:%02X:%02X:%02X  RSSI: %d dBm\n",
                         ble_devices[i].address[0], ble_devices[i].address[1],
                         ble_devices[i].address[2], ble_devices[i].address[3],
                         ble_devices[i].address[4], ble_devices[i].address[5],
                         ble_devices[i].rssi);
        }
    }
    
