g91/esp32-p4-Domo-cpu-emulator/main/hello_world_main.c
    return 0;
}

static int cmd_btconnect(int argc, char **argv) {
    console_printf("Bluetooth connection not yet available.\n");
    console_printf("Run 'btinit' for details on Bluetooth support status.\n");
    return 0;
}

static int cmd_btdisconnect(int argc, char **argv) {
    console_printf("Bluetooth disconnection not yet available.\n");
    console_printf("Run 'btinit' for details on Bluetooth support status.\n");
    return 0;
}

static int cmd_btlist(int argc, char **argv) {
    if (!bt_initialized) {
        console_printf("Bluetooth not initialized. Run 'btinit' first.\n");
        return 1;
    }
    
    console_printf("\n=== Bluetooth Status ===\n");
    console_printf("Mode: BLE (NimBLE) via ESP-Hosted SDIO\n");
    console_printf("Status: %s\n\n", bt_scanning ? "Scanning..." : "Idle");
    
    if (ble_device_count == 0) {
        console_printf("No devices discovered. Run 'btscan' to find devices.\n");
    } else {
        console_printf("Discovered Devices: %d\n", ble_device_count);
        for (int i = 0; i < ble_device_count; i++) {
            console_printf("  %d. %s\n", i + 1, ble_devices[i].name);
            console_printf("     MAC: %02X:%02X:%02X:%02X:%02X:%02X  RSSI: %d dBm\n",
                         ble_devices[i].address[0], ble_devices[i].address[1],
                         ble_devices[i].address[2], ble_devices[i].address[3],
                         ble_devices[i].address[4], ble_devices[i].address[5],
                         ble_devices[i].rssi);
        }
    }
    
    return 0;
}

/*
 * i386 PC Emulator Commands (REMOVED)
 */
static int cmd_init386(int argc, char **argv) {
    console_printf("i386 PC emulator has been removed from this build\n");
    console_printf("The tiny386 integration was too large and unstable\n");
    return ESP_OK;
}

static void register_i386_commands(void) {
    const esp_console_cmd_t init386_cmd = {
        .command = "init386",
        .help = "i386 PC emulator (removed)",
        .hint = NULL,
        .func = &cmd_init386,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&init386_cmd));
}

static void register_bluetooth_commands(void) {
    const esp_console_cmd_t btinit_cmd = {
        .command = "btinit",
        .help = "Initialize Bluetooth controller",
        .hint = NULL,
        .func = &cmd_btinit,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&btinit_cmd));
    
    const esp_console_cmd_t btscan_cmd = {
        .command = "btscan",
        .help = "Scan for Bluetooth devices",
        .hint = "[duration_sec]",
        .func = &cmd_btscan,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&btscan_cmd));
    
    const esp_console_cmd_t btconnect_cmd = {
        .command = "btconnect",
        .help = "Connect to Bluetooth device",
        .hint = "<MAC address>",
        .func = &cmd_btconnect,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&btconnect_cmd));
    
    const esp_console_cmd_t btdisconnect_cmd = {
        .command = "btdisconnect",
        .help = "Disconnect Bluetooth device",
        .hint = "<MAC address>",
        .func = &cmd_btdisconnect,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&btdisconnect_cmd));
    
    const esp_console_cmd_t btlist_cmd = {
        .command = "btlist",
        .help = "List Bluetooth devices and status",
        .hint = NULL,
        .func = &cmd_btlist,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&btlist_cmd));
}

static void register_app_commands(void) {
    const esp_console_cmd_t runm68k_cmd = {
        .command = "runm68k",
        .help = "Load and run M68K binary from SD card",
        .hint = "<filename>",
        .func = &cmd_run_m68k,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&runm68k_cmd));
    
    const esp_console_cmd_t appinfo_cmd = {
        .command = "appinfo",
        .help = "Show current application info",
        .hint = NULL,
        .func = &cmd_appinfo,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&appinfo_cmd));
    
    const esp_console_cmd_t appstop_cmd = {
        .command = "appstop",
        .help = "Stop current application",
        .hint = NULL,
        .func = &cmd_appstop,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&appstop_cmd));
}

/*
 * Custom line input function that reads from both UART and PS/2 keyboard
 * Returns a malloc'd string that must be freed by the caller
 * Supports command history navigation with arrow keys
 */
static char* read_line_dual_input(const char *prompt) {
    static char line_buffer[256];
    int pos = 0;
    int history_index = cmd_history_count;  // Start at end (newest command)
    bool in_escape_seq = false;
    uint8_t escape_buf[3] = {0};
    int escape_pos = 0;
    
    // Print prompt to both outputs
    console_printf("%s", prompt);
    
    while (pos < sizeof(line_buffer) - 1) {
        uint8_t c = 0;
        
        // Check PS/2 keyboard input first (if initialized)
        if (ps2_keyboard_is_initialized() && ps2_keyboard_available()) {
            c = ps2_keyboard_read();
        }
        
        // Check USB keyboard input
        if (c == 0 && usb_keyboard_is_initialized() && usb_keyboard_available()) {
            c = usb_keyboard_read();
        }
        
        // If no PS/2 keyboard input, check UART/USB Serial
        if (c == 0) {
            int uart_char = -1;
            size_t len = 0;
            uart_get_buffered_data_len(CONFIG_ESP_CONSOLE_UART_NUM, &len);
            if (len > 0) {
                uint8_t buf;
                if (uart_read_bytes(CONFIG_ESP_CONSOLE_UART_NUM, &buf, 1, 0) == 1) {
                    uart_char = buf;
                }
            }
            if (uart_char >= 0) {
                c = (uint8_t)uart_char;
            }
        }
        
        // No input from any source
        if (c == 0) {
            vTaskDelay(pdMS_TO_TICKS(10));
            continue;
        }
        
        // Handle escape sequences for arrow keys
        if (in_escape_seq) {
            escape_buf[escape_pos++] = c;
            
            // Check if we have a complete arrow key sequence
            if (escape_pos >= 2) {
                if (escape_buf[0] == '[') {
                    // Arrow up: ESC[A - go back in history (older command)
                    if (escape_buf[1] == 'A' && cmd_history_count > 0 && history_index > 0) {
                        history_index--;
                        if (history_index < cmd_history_count && cmd_history[history_index]) {
                            // Clear current line
                            while (pos > 0) {
                                console_printf("\b \b");
                                pos--;
                            }
                            // Copy history entry to buffer
                            strncpy(line_buffer, cmd_history[history_index], sizeof(line_buffer) - 1);
                            line_buffer[sizeof(line_buffer) - 1] = '\0';
                            pos = strlen(line_buffer);
                            // Display it
                            console_printf("%s", line_buffer);
                        }
                    }
                    // Arrow down: ESC[B - go forward in history (newer command)
                    else if (escape_buf[1] == 'B' && cmd_history_count > 0) {
                        if (history_index < cmd_history_count) {
                            history_index++;
                            if (history_index >= cmd_history_count) {
                                // At newest entry, clear line
                                while (pos > 0) {
                                    console_printf("\b \b");
                                    pos--;
                                }
                                line_buffer[0] = '\0';
                            } else if (cmd_history[history_index]) {
                                // Clear current line
                                while (pos > 0) {
                                    console_printf("\b \b");
                                    pos--;
                                }
                                // Copy history entry to buffer
                                strncpy(line_buffer, cmd_history[history_index], sizeof(line_buffer) - 1);
                                line_buffer[sizeof(line_buffer) - 1] = '\0';
                                pos = strlen(line_buffer);
                                // Display it
                                console_printf("%s", line_buffer);
                            }
                        }
                    }
                    // Arrow right (ESC[C) and left (ESC[D) - ignore for now
                }
                in_escape_seq = false;
                escape_pos = 0;
            }
            continue;
        }
        
        // Handle special keys
        if (c == '\r' || c == '\n') {
            // Enter key - end of line
            line_buffer[pos] = '\0';
            console_printf("\n");
            
