g91/esp32-p4-Domo-cpu-emulator/main/hello_world_main.c
            // Return a copy of the line
            char *result = malloc(pos + 1);
            if (result) {
                strcpy(result, line_buffer);
            }
            return result;
        }
        else if (c == '\b' || c == 0x7F) {
            // Backspace
            if (pos > 0) {
                pos--;
                console_printf("\b \b");  // Erase character on screen
            }
        }
        else if (c == 0x03) {
            // Ctrl+C - cancel line
            console_printf("^C\n");
            return NULL;
        }
        else if (c == 0x1B) {
            // Start of escape sequence (arrow keys send ESC[A, ESC[B, etc.)
            in_escape_seq = true;
            escape_pos = 0;
            escape_buf[0] = 0;
            escape_buf[1] = 0;
            escape_buf[2] = 0;
        }
        else if (c >= 0x20 && c < 0x7F) {
            // Printable character
            line_buffer[pos++] = c;
            // Echo to both outputs
            char echo[2] = {c, '\0'};
            console_printf("%s", echo);
        }
        // Ignore other special keys (function keys, etc.)
    }
    
    // Buffer full
    line_buffer[pos] = '\0';
    char *result = malloc(pos + 1);
    if (result) {
        strcpy(result, line_buffer);
    }
    return result;
}

/*
 * PS/2 Keyboard diagnostic command
 */
static int cmd_ps2test(int argc, char **argv) {
    console_printf("=== PS/2 Keyboard Test ===\n");
    
    if (!ps2_keyboard_is_initialized()) {
        console_printf("ERROR: PS/2 keyboard not initialized!\n");
        return 1;
    }
    
    console_printf("PS/2 keyboard is initialized\n");
    console_printf("CLK Pin: GPIO5\n");
    console_printf("DATA Pin: GPIO23\n");
    console_printf("\n");
    console_printf("Press keys on PS/2 keyboard (Ctrl+C to exit)...\n");
    console_printf("Note: Also check UART serial output for debug messages\n");
    
    // Test for 30 seconds or until Ctrl+C
    int count = 0;
    for (int i = 0; i < 300; i++) {  // 30 seconds
        if (ps2_keyboard_available()) {
            uint8_t key = ps2_keyboard_read();
            if (key == 3) {  // Ctrl+C
                console_printf("\n");
                break;
            }
            console_printf("Key received: 0x%02X", key);
            if (key >= 32 && key < 127) {
                console_printf(" '%c'", key);
            }
            console_printf("\n");
            count++;
        }
        vTaskDelay(pdMS_TO_TICKS(100));
    }
    
    console_printf("\nTest complete. Received %d keys.\n", count);
    
    if (count == 0) {
        console_printf("\nTroubleshooting:\n");
        console_printf("1. Check wiring: CLK=GPIO5, DATA=GPIO23, GND, VCC (5V)\n");
        console_printf("2. Verify PS/2 connector orientation\n");
        console_printf("3. Try external 4.7k pull-up resistors on CLK and DATA\n");
        console_printf("4. Check serial monitor for ISR/GPIO error messages\n");
    }
    
    return 0;
}

static int cmd_lcdpins(int argc, char **argv) {
    int rst_pin, bl_pin, mosi_pin, clk_pin;
    
    lcd_console_get_pins(&rst_pin, &bl_pin, &mosi_pin, &clk_pin);
    
    console_printf("\n=== LCD GPIO Pin Configuration ===\n");
    console_printf("RST (Reset):      GPIO%d\n", rst_pin);
    console_printf("BL (Backlight):   GPIO%d\n", bl_pin);
    console_printf("MOSI (Data):      GPIO%d\n", mosi_pin);
    console_printf("CLK (Clock):      GPIO%d\n", clk_pin);
    console_printf("\nThese are the pin numbers compiled into the firmware.\n");
    console_printf("If the display works on a different pin, there may be\n");
    console_printf("a hardware issue or ESP-IDF driver override.\n");
    
    return 0;
}

void app_main(void) {
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);
    
    initialize_console();
    register_linux_commands();  // Register ls, cd, pwd, cat, etc. first
    register_m68k_commands();
    register_i8086_commands();
    register_6502_commands();
    register_apple2e_commands();
    register_video_commands();
    register_i386_commands();       // Register i386 emulator commands
    register_bluetooth_commands();  // Register Bluetooth commands
    register_wifi_ftp_commands();   // Register WiFi and FTP commands
    register_app_commands();
    
    // Register Atari ST commands
    const esp_console_cmd_t stop_atari_cmd = {
        .command = "stopatari",
        .help = "Stop Atari ST emulator",
        .hint = NULL,
        .func = &cmd_stop_atari,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&stop_atari_cmd));
    
    const esp_console_cmd_t state_atari_cmd = {
        .command = "stateatari",
        .help = "Show Atari ST emulator state",
        .hint = NULL,
        .func = &cmd_state_atari,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&state_atari_cmd));

    // Register Amiga commands
    const esp_console_cmd_t stop_amiga_cmd = {
        .command = "stopamiga",
        .help = "Stop Amiga emulator",
        .hint = NULL,
        .func = &cmd_stop_amiga,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&stop_amiga_cmd));

    const esp_console_cmd_t state_amiga_cmd = {
        .command = "stateamiga",
        .help = "Show Amiga emulator state",
        .hint = NULL,
        .func = &cmd_state_amiga,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&state_amiga_cmd));

    const esp_console_cmd_t amiga_floppy_cmd = {
        .command = "amigafloppy",
        .help = "Insert/eject Amiga floppy: amigafloppy <path|eject> [drive]",
        .hint = NULL,
        .func = &cmd_amiga_floppy,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&amiga_floppy_cmd));

    const esp_console_cmd_t amiga_hdf_cmd = {
        .command = "amigahdf",
        .help = "Mount/unmount Amiga HDF: amigahdf <path|eject> [unit]",
        .hint = NULL,
        .func = &cmd_amiga_hdf,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&amiga_hdf_cmd));

