g91/esp32-p4-Domo-cpu-emulator/main/hello_world_main.c
    // Register PS/2 test command
    const esp_console_cmd_t ps2test_cmd = {
        .command = "ps2test",
        .help = "Test PS/2 keyboard functionality",
        .hint = NULL,
        .func = &cmd_ps2test,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&ps2test_cmd));
    
    // Register LCD pins diagnostic command
    const esp_console_cmd_t lcdpins_cmd = {
        .command = "lcdpins",
        .help = "Show LCD GPIO pin configuration",
        .hint = NULL,
        .func = &cmd_lcdpins,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&lcdpins_cmd));
    
    // Initialize bus controller (shared networking, DMA, etc.)
    printf("Initializing bus controller...\n");
    ret = bus_controller_init();
    if (ret == ESP_OK) {
        printf("✓ Bus controller initialized\n");
        printf("  Shared TCP/UDP stack ready\n");
        printf("  DMA controller ready\n");
        printf("  Application loader ready\n");
    } else {
        printf("✗ Bus controller init failed: %s\n", esp_err_to_name(ret));
    }
    
    // Initialize LCD console
    printf("Initializing LCD console...\n");
    ret = lcd_console_init();
    if (ret == ESP_OK) {
        lcd_console_active = true;
        printf("✓ LCD console initialized (%dx%d chars)\n", CONSOLE_COLS, CONSOLE_ROWS);
    } else {
        printf("✗ LCD console initialization failed: %s\n", esp_err_to_name(ret));
        printf("  Continuing with UART console only\n");
    }
    
    // Initialize PS/2 keyboard (CLK=GPIO5, DATA=GPIO23)
    printf("Initializing PS/2 keyboard...\n");
    ret = ps2_keyboard_init();
    if (ret == ESP_OK) {
        printf("✓ PS/2 keyboard driver initialized\n");
    } else {
        printf("✗ PS/2 keyboard initialization failed: %s\n", esp_err_to_name(ret));
        printf("  Fallback to UART input\n");
    }
    
    // Initialize USB HID keyboard (USB Type-A host port)
    printf("Initializing USB keyboard...\n");
    ret = usb_keyboard_init();
    if (ret == ESP_OK) {
        printf("✓ USB keyboard driver initialized (plug in USB keyboard)\n");
    } else {
        printf("✗ USB keyboard initialization failed: %s\n", esp_err_to_name(ret));
        printf("  Continuing without USB keyboard support\n");
    }
    
    // Register SD card auto-mount callback so FTP server can mount it automatically
    ftp_server_set_mount_cb(mount_sd_card);

    // Initialize WiFi with ESP32-C6 coprocessor (SDIO)
    printf("Initializing WiFi (ESP32-C6 via SDIO)...\n");
    
    // Initialize network interface
    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());
    esp_netif_create_default_wifi_sta();
    
    // Register WiFi event handler
    ESP_ERROR_CHECK(esp_event_handler_register(WIFI_EVENT, ESP_EVENT_ANY_ID, &wifi_event_handler, NULL));
    ESP_ERROR_CHECK(esp_event_handler_register(IP_EVENT, IP_EVENT_STA_GOT_IP, &wifi_event_handler, NULL));
    
    // Initialize WiFi
    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ret = esp_wifi_init(&cfg);
    if (ret == ESP_OK) {
        ret = esp_wifi_set_mode(WIFI_MODE_STA);
        if (ret == ESP_OK) {
            ret = esp_wifi_start();  // Start WiFi
            if (ret == ESP_OK) {
                wifi_initialized = true;
                printf("✓ WiFi initialized and started via SDIO\n");
                
                // Auto-connect to default WiFi network
                printf("Connecting to WiFi (doc007)...\n");
                wifi_config_t wifi_config = {0};
                strcpy((char *)wifi_config.sta.ssid, "doc007");
                strcpy((char *)wifi_config.sta.password, "16221699");
                wifi_config.sta.threshold.authmode = WIFI_AUTH_WPA2_PSK;
                wifi_config.sta.pmf_cfg.capable = true;
                wifi_config.sta.pmf_cfg.required = false;
                
                ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_STA, &wifi_config));
                esp_err_t conn_ret = esp_wifi_connect();
                if (conn_ret == ESP_OK) {
                    printf("✓ WiFi connection initiated\n");
                    printf("  FTP server will auto-start when connected\n");
                } else {
                    printf("✗ WiFi connect failed: %s\n", esp_err_to_name(conn_ret));
                    printf("  Use 'connect <ssid> <password>' to retry\n");
                }
            } else {
                printf("✗ WiFi start failed: %s\n", esp_err_to_name(ret));
            }
        } else {
            printf("✗ WiFi mode set failed: %s\n", esp_err_to_name(ret));
        }
    } else {
        printf("✗ WiFi init failed: %s\n", esp_err_to_name(ret));
        printf("  WiFi commands will not be available\n");
    }
    
    // Initialize Ethernet (RJ45 100M with IP101 PHY)
    printf("Initializing Ethernet (RJ45 100M)...\n");
    // Register Ethernet event handlers for auto-starting services
    esp_event_handler_register(ETH_EVENT, ESP_EVENT_ANY_ID, &eth_event_handler_main, NULL);
    esp_event_handler_register(IP_EVENT, IP_EVENT_ETH_GOT_IP, &eth_event_handler_main, NULL);
    ret = ethernet_init();
    if (ret == ESP_OK) {
        ethernet_initialized = true;
        printf("✓ Ethernet initialized (IP101 PHY)\n");
        printf("  Plug in Ethernet cable for wired network\n");
    } else {
        printf("✗ Ethernet init failed: %s\n", esp_err_to_name(ret));
        printf("  Continuing without Ethernet support\n");
    }
    
    // Initialize Bluetooth with ESP32-C6 coprocessor (SDIO)
    printf("Initializing Bluetooth (ESP32-C6 via SDIO)...\n");
    ret = nimble_port_init();
    if (ret == ESP_OK) {
        // Configure NimBLE host
        ble_hs_cfg.sync_cb = NULL;
        ble_hs_cfg.reset_cb = NULL;
        
        // Start NimBLE host task
        nimble_port_freertos_init(nimble_host_task);
        
        bt_initialized = true;
        printf("✓ Bluetooth initialized (BLE via NimBLE)\n");
        printf("  Use 'btscan' to discover devices, 'btlist' to show results\n");
    } else {
        printf("✗ Bluetooth init failed: %s\n", esp_err_to_name(ret));
        printf("  Bluetooth commands will not be available\n");
    }
    
    // Show boot splash on LCD (do this BEFORE other initializations)
    show_boot_splash();
    
    // Silent boot - only show critical errors
    ret = m68k_init();
    if (ret != ESP_OK) {
        printf("CPU init failed: %s\n", esp_err_to_name(ret));
    }
    
    // Quick SD card mount (single attempt, no verbose output)
    vTaskDelay(pdMS_TO_TICKS(200));
    ret = mount_sd_card();
    
