g91/esp32-p4-Domo-cpu-emulator/main/hello_world_main.c
    // Load command history from SD card
    if (ret == ESP_OK) {
        load_history();
        
        // Try to auto-boot OS.bin from SD card
        // If OS boots successfully, it takes over and we skip the BIOS shell
        bool os_booted = try_autoboot();
        if (os_booted) {
            // OS is running in background task, keep alive but don't show BIOS shell
            printf("M68K-OS is running. UART available for monitoring.\n");
            printf("Reset to return to BIOS.\n\n");
            while (true) {
                vTaskDelay(pdMS_TO_TICKS(1000));
            }
        }
    }
    
    // Clear splash and show ready prompt on LCD (only if OS didn't boot)
    // Guard: if video card is running, use it instead of lcd_console to avoid SPI contention
    if (video_card_is_initialized()) {
        video_card_text_clear();
        video_card_print("M68K BIOS READY\n");
        video_card_print("================\n\n");
        char buf[64];
        snprintf(buf, sizeof(buf), "CPU: 68000 @ 60MHz\n");
        video_card_print(buf);
        snprintf(buf, sizeof(buf), "RAM: %lu KB\n", 
                 (unsigned long)(heap_caps_get_free_size(MALLOC_CAP_SPIRAM) / 1024));
        video_card_print(buf);
        if (sd_mounted) {
            video_card_print("SD:  Mounted\n");
        }
        video_card_print("\nType 'help' for commands\n\n");
    } else if (lcd_console_is_initialized()) {
        lcd_console_clear();
        lcd_console_print("M68K BIOS READY\n");
        lcd_console_print("================\n\n");
        
        // Show minimal system info on LCD
        char buf[64];
        snprintf(buf, sizeof(buf), "CPU: 68000 @ 60MHz\n");
        lcd_console_print(buf);
        snprintf(buf, sizeof(buf), "RAM: %lu KB\n", 
                 (unsigned long)(heap_caps_get_free_size(MALLOC_CAP_SPIRAM) / 1024));
        lcd_console_print(buf);
        if (sd_mounted) {
            lcd_console_print("SD:  Mounted\n");
        }
        lcd_console_print("\nType 'help' for commands\n\n");
    }
    
    // UART shows minimal boot info
    printf("\n");
    printf("M68K BIOS v1.0\n");
    printf("Ready. Type 'help' for commands.\n");
    printf("\n");
    
    // Dynamic prompt showing current directory
    char prompt[300];
    
    // Use custom input that reads from both UART and PS/2
    while (true) {
        // Build prompt with current directory (bash-style)
        const char *dir = current_working_dir;
        // Show shortened path if in /sdcard
        if (strncmp(dir, "/sdcard", 7) == 0) {
            if (strlen(dir) == 7) {
                strncpy(prompt, "m68k:~$ ", sizeof(prompt) - 1);
            } else {
                snprintf(prompt, sizeof(prompt), "m68k:~%s$ ", dir + 7);
            }
        } else {
            snprintf(prompt, sizeof(prompt), "m68k:%s$ ", dir);
        }
        prompt[sizeof(prompt) - 1] = '\0';
        
        char* line = read_line_dual_input(prompt);
        if (line == NULL) {
            continue;
        }
        
        if (strlen(line) > 0) {
            linenoiseHistoryAdd(line);
            append_to_history_file(line);
            
            // Add to our local history for arrow key navigation
            if (cmd_history_count < MAX_HISTORY_LINES) {
                cmd_history[cmd_history_count] = strdup(line);
                if (cmd_history[cmd_history_count]) {
                    cmd_history_count++;
                }
            } else {
                // History full, shift and replace oldest
                free(cmd_history[0]);
                for (int i = 0; i < MAX_HISTORY_LINES - 1; i++) {
                    cmd_history[i] = cmd_history[i + 1];
                }
                cmd_history[MAX_HISTORY_LINES - 1] = strdup(line);
            }
        }
        
        int cmd_ret;
        esp_err_t err = esp_console_run(line, &cmd_ret);
        if (err == ESP_ERR_NOT_FOUND) {
            console_printf("Unknown command\n");
        } else if (err == ESP_ERR_INVALID_ARG) {
            // Command was empty
        } else if (err == ESP_OK && cmd_ret != ESP_OK) {
            console_printf("Error: 0x%x (%s)\n", cmd_ret, esp_err_to_name(cmd_ret));
        } else if (err != ESP_OK) {
            console_printf("Internal error: %s\n", esp_err_to_name(err));
        }
        
        free(line);
    }
}
